{
  "title": "Connect to an external Redis database",
  "source_url": "https://docs.langchain.com/langsmith/self-host-external-redis",
  "content": "LangSmith uses Redis to back our queuing/caching operations. By default, LangSmith Self-Hosted will use an internal Redis instance. However, you can configure LangSmith to use an external Redis instance. By configuring an external Redis instance, you can more easily manage backups, scaling, and other operational tasks for your Redis instance.\n\n## Requirements\n\n* A provisioned Redis instance that your LangSmith instance will have network access to. We recommend using a managed Redis service like:\n\n  * [Amazon ElastiCache](https://aws.amazon.com/elasticache/redis/)\n  * [Google Cloud Memorystore](https://cloud.google.com/memorystore)\n  * [Azure Cache for Redis](https://azure.microsoft.com/en-us/services/cache/)\n\n* Note: We only officially support Redis versions >= 5.\n\n* We do not support Redis Cluster.\n\n* By default, we recommend an instance with at least 2 vCPUs and 8GB of memory. However, the actual requirements will depend on your tracing workload. We recommend monitoring your Redis instance and scaling up as needed.\n\n<Info>\n  Certain tiers of managed Redis services may use Redis Cluster under the hood, but you can point to a single node in the cluster. For example on Azure Cache for Redis, the `Premium` tier and above use Redis Cluster, so you will need to use a lower tier.\n</Info>\n\n## Connection String\n\nWe use `redis-py` to connect to Redis. This library supports a variety of connection strings. You can find more information on the connection string format [here](https://redis-py.readthedocs.io/en/stable/#redis.StrictRedis.from_url).\n\nYou will need to assemble the connection string for your Redis instance. This connection string should include the following information:\n\n* Host\n* Database\n* Port\n* URL params\n\nThis will take the form of:\n\n```\n\"redis://host:port/db?<url_params>\"\n```\n\nAn example connection string might look like:\n\n```\n\"redis://langsmith-redis:6379/0\"\n```\n\nTo use SSL, you can use the `rediss://` prefix. An example connection string with SSL might look like:\n\n```\n\"rediss://langsmith-redis:6380/0?password=foo\"\n```\n\n## Configuration\n\nWith your connection string in hand, you can configure your LangSmith instance to use an external Redis instance. You can do this by modifying the `values` file for your LangSmith Helm Chart installation or the `.env` file for your Docker installation.\n\n<CodeGroup>\n  ```yaml Helm theme={null}\n  redis:\n    external:\n      enabled: true\n      connectionUrl: \"Your connection url\"\n  ```\n\n  ```bash Docker theme={null}\n  # In your .env file\n  REDIS_DATABASE_URI=\"Your connection url\"\n  ```\n</CodeGroup>\n\nOnce configured, you should be able to reinstall your LangSmith instance. If everything is configured correctly, your LangSmith instance should now be using your external Redis instance.\n\n***\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit the source of this page on GitHub.](https://github.com/langchain-ai/docs/edit/main/src/langsmith/self-host-external-redis.mdx)\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs programmatically](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "content_length": 3137
}