{
  "title": "Security policy",
  "source_url": "https://docs.langchain.com/oss/javascript/security-policy",
  "content": "LangChain has a large ecosystem of integrations with various external resources like local and remote file systems, APIs and databases. These integrations allow developers to create versatile applications that combine the power of LLMs with the ability to access, interact with and manipulate external resources.\n\n## Best practices\n\nWhen building such applications developers should remember to follow good security practices:\n\n* [**Limit permissions**](https://en.wikipedia.org/wiki/Principle_of_least_privilege): Scope permissions specifically to the application's need. Granting broad or excessive permissions can introduce significant security vulnerabilities. To avoid such vulnerabilities, consider using read-only credentials, disallowing access to sensitive resources, using sandboxing techniques (such as running inside a container), specifying proxy configurations to control external requests, etc. as appropriate for your application.\n* **Anticipate potential misuse**: Just as humans can err, so can Large Language Models (LLMs). Always assume that any system access or credentials may be used in any way allowed by the permissions they are assigned. For example, if a pair of database credentials allows deleting data, it's safest to assume that any LLM able to use those credentials may in fact delete data.\n* [**Defense in depth**](https://en.wikipedia.org/wiki/Defense_in_depth_\\(computing\\)): No security technique is perfect. Fine-tuning and good chain design can reduce, but not eliminate, the odds that a Large Language Model (LLM) may make a mistake. It's best to combine multiple layered security approaches rather than relying on any single layer of defense to ensure security. For example: use both read-only permissions and sandboxing to ensure that LLMs are only able to access data that is explicitly meant for them to use.\n\nRisks of not doing so include, but are not limited to:\n\n* Data corruption or loss.\n* Unauthorized access to confidential information.\n* Compromised performance or availability of critical resources.\n\nExample scenarios with mitigation strategies:\n\n* A user may ask an agent with access to the file system to delete files that should not be deleted or read the content of files that contain sensitive information. To mitigate, limit the agent to only use a specific directory and only allow it to read or write files that are safe to read or write. Consider further sandboxing the agent by running it in a container.\n* A user may ask an agent with write access to an external API to write malicious data to the API, or delete data from that API. To mitigate, give the agent read-only API keys, or limit it to only use endpoints that are already resistant to such misuse.\n* A user may ask an agent with access to a database to drop a table or mutate the schema. To mitigate, scope the credentials to only the tables that the agent needs to access and consider issuing READ-ONLY credentials.\n\nIf you're building applications that access external resources like file systems, APIs\nor databases, consider speaking with your company's security team to determine how to best\ndesign and secure your applications.\n\n## Reporting OSS vulnerabilities\n\nLangChain is partnered with [huntr by Protect AI](https://huntr.com/) to provide\na bounty program for our open source projects.\n\nPlease report security vulnerabilities associated with the LangChain\nopen source projects at [huntr](https://huntr.com/bounties/disclose/?target=https%3A%2F%2Fgithub.com%2Flangchain-ai%2Flangchain\\&validSearch=true).\n\nBefore reporting a vulnerability, please review:\n\n1. [In-scope targets](#in-scope-targets) and [out-of-scope targets](#out-of-scope-targets).\n2. The [langchain-ai/langchain](https://python.langchain.com/docs/contributing/repo_structure) monorepo structure.\n3. The [best practices](#best-practices) above to\n   understand what we consider to be a security vulnerability vs. developer\n   responsibility.\n\n### In-scope targets\n\nThe following packages and repositories are eligible for bug bounties:\n\n* langchain-core\n* langchain (see exceptions)\n* langchain-community (see exceptions)\n* langgraph\n* langserve\n\n### Out-of-scope targets\n\nAll out of scope targets defined by huntr as well as:\n\n* **langchain-experimental**: This repository is for experimental code and is not\n  eligible for bug bounties (see [package warning](https://pypi.org/project/langchain-experimental/)), bug reports to it will be marked as interesting or waste of\n  time and published with no bounty attached.\n* **tools**: Tools in either langchain or langchain-community are not eligible for bug\n  bounties. This includes the following directories\n  * libs/langchain/langchain/tools\n  * libs/community/langchain\\_community/tools\n  * Please review the [best practices](#best-practices)\n    for more details, but generally tools interact with the real world. Developers are\n    expected to understand the security implications of their code and are responsible\n    for the security of their tools.\n* Code documented with security notices. This will be decided on a case by\n  case basis, but likely will not be eligible for a bounty as the code is already\n  documented with guidelines for developers that should be followed for making their\n  application secure.\n* Any LangSmith related repositories or APIs (see [Reporting LangSmith vulnerabilities](#reporting-langsmith-vulnerabilities)).\n\n## Reporting LangSmith vulnerabilities\n\nPlease report security vulnerabilities associated with LangSmith by email to `security@langchain.dev`.\n\n* LangSmith site: [https://smith.langchain.com](https://smith.langchain.com)\n* SDK client: [https://github.com/langchain-ai/langsmith-sdk](https://github.com/langchain-ai/langsmith-sdk)\n\n### Other security concerns\n\nFor any other security concerns, please contact us at `security@langchain.dev`.\n\n***\n\n<Callout icon=\"pen-to-square\" iconType=\"regular\">\n  [Edit the source of this page on GitHub.](https://github.com/langchain-ai/docs/edit/main/src/oss/security-policy.mdx)\n</Callout>\n\n<Tip icon=\"terminal\" iconType=\"regular\">\n  [Connect these docs programmatically](/use-these-docs) to Claude, VSCode, and more via MCP for real-time answers.\n</Tip>",
  "content_length": 6189
}