{
  "title": "How to cancel running workflows",
  "source_url": "https://docs-3.prefect.io/v3/advanced/cancel-workflows",
  "content": "You can cancel a scheduled or in-progress flow run from the CLI, UI, REST API, or Python client.\n\nWhen requesting cancellation, the flow run moves to a \"Cancelling\" state.\nIf the deployment is associated with a work pool, then the worker monitors\nthe state of flow runs and detects that cancellation is requested.\nThe worker then sends a signal to the flow run infrastructure, requesting termination of the run.\nIf the run does not terminate after a grace period (default of 30 seconds), the infrastructure is killed, ensuring the flow run exits.\n\n<Warning>\n  **A deployment is required**\n\n  Flow run cancellation requires that the flow run is associated with a deployment.\n  A monitoring process must be running to enforce the cancellation.\n\n  Inline nested flow runs (those created without `run_deployment`), cannot be cancelled without cancelling the parent flow run.\n  To cancel a nested flow run independent of its parent flow run, we recommend deploying it separately\n  and starting it using the [run\\_deployment](/v3/deploy/index)\n  function.\n</Warning>\n\nCancellation is resilient to restarts of Prefect workers.\nTo enable this, we attach metadata about the created infrastructure to the flow run.\nInternally, this is referred to as the `infrastructure_pid` or infrastructure identifier.\nGenerally, this is composed of two parts:\n\n* Scope: identifying where the infrastructure is running.\n* ID: a unique identifier for the infrastructure within the scope.\n\nThe scope ensures that Prefect does not kill the wrong infrastructure.\nFor example, workers running on multiple machines may have overlapping process IDs but should not have a matching scope.\n\nThe identifiers for infrastructure types are:\n\n* Processes: The machine hostname and the PID.\n* Docker Containers: The Docker API URL and container ID.\n* Kubernetes Jobs: The Kubernetes cluster name and the job name.\n\nWhile the cancellation process is robust, there are a few issues than can occur:\n\n* If the infrastructure for the flow run does not support cancellation, cancellation will not work.\n* If the identifier scope does not match when attempting to cancel a flow run, the worker cannot cancel the flow run.\n  Another worker may attempt cancellation.\n* If the infrastructure associated with the run cannot be found or has already been killed, the worker marks the flow run as cancelled.\n* If the `infrastructre_pid` is missing, the flow run is marked as cancelled but cancellation cannot be enforced.\n* If the worker runs into an unexpected error during cancellation, the flow run may or may not be cancelled\n  depending on where the error occurred. The worker will try again to cancel the flow run. Another worker may attempt cancellation.\n\n### Cancel through the CLI\n\nFrom the command line in your execution environment, you can cancel a flow run by using the\n`prefect flow-run cancel` CLI command, passing the ID of the flow run.\n\n```bash  theme={null}\nprefect flow-run cancel 'a55a4804-9e3c-4042-8b59-b3b6b7618736'\n```\n\n### Cancel through the UI\n\nNavigate to the flow run's detail page and click `Cancel` in the upper right corner.\n\n<img src=\"https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=6e692111f666595d04889e2e26186ebb\" alt=\"Prefect UI\" data-og-width=\"2484\" width=\"2484\" data-og-height=\"619\" height=\"619\" data-path=\"v3/img/ui/flow-run-cancellation-ui.png\" data-optimize=\"true\" data-opv=\"3\" srcset=\"https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=280&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=da4cf5fef78b5f9f3ab144f0ae6b56a8 280w, https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=560&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=917aba861a600e28071bbeff920d168f 560w, https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=840&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=98251b34c529c3598a1124bcdd359788 840w, https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=1100&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=d99273805a2a9391839f2c44fb5ed6a4 1100w, https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=1650&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=78e0cb692fc0219ab3318dc1bac96754 1650w, https://mintcdn.com/prefect-bd373955/dwD6EJObIjtIzwSC/v3/img/ui/flow-run-cancellation-ui.png?w=2500&fit=max&auto=format&n=dwD6EJObIjtIzwSC&q=85&s=ee4a0d68779a919dc8c25399861c8ec0 2500w\" />",
  "content_length": 4577
}