{
  "title": "Prefect server",
  "source_url": "https://docs-3.prefect.io/v3/concepts/server",
  "content": "Self-host your own Prefect server instance.\n\nAfter installing Prefect, you have a Python SDK client that can communicate with either [Prefect Cloud](/v3/how-to-guides/cloud/connect-to-cloud) or a self-hosted Prefect server, backed by a database and a UI.\n\nPrefect Cloud and self-hosted Prefect server share a common set of capabilities. Prefect Cloud provides the additional features required by organizations such as RBAC, Audit logs, and SSO. See the [Prefect Cloud overview](/v3/how-to-guides/cloud/connect-to-cloud) for more information.\n\n<Warning>\n  We recommend using the same version of `prefect` for the client and server.\n  Old clients are compatible with new servers, but new clients can be incompatible with old servers as new fields are added to the REST API.\n  The server will typically return a 422 status code if any issues occur.\n</Warning>\n\n## The Prefect database\n\nThe Prefect database persists data to track the state of your flow runs and related Prefect concepts, including:\n\n* Flow run and task run state\n* Run history\n* Logs\n* Deployments\n* Flow and task run concurrency limits\n* Storage blocks for flow and task results\n* Variables\n* Artifacts\n* Work pool status\n* Events\n* Automations\n\nPrefect supports the following databases:\n\n* **SQLite** (default): Recommended for lightweight, single-server deployments. SQLite requires essentially no setup.\n* **PostgreSQL**: Best for production use, high availability, and multi-server deployments. Requires PostgreSQL 14.9 or higher. Prefect uses the [`pg_trgm`](https://www.postgresql.org/docs/current/pgtrgm.html) extension, so it must be installed and enabled.\n\n## Database migrations\n\nPrefect uses [Alembic](https://alembic.sqlalchemy.org/en/latest/) to manage database migrations. Alembic is a database migration tool that provides a framework for generating and applying schema changes to a database.\n\nWhen you start a Prefect server, it automatically runs any necessary migrations. You can also manage migrations manually using the CLI.\n\n## How to guides\n\n* [Self-host via CLI](/v3/how-to-guides/self-hosted/server-cli) - Start a local server instance\n* [Self-host via Docker](/v3/how-to-guides/self-hosted/server-docker) - Run server in containers\n* [Scale self-hosted Prefect](/v3/advanced/self-hosted) - Deploy multiple server instances for high availability",
  "content_length": 2334
}