{
  "title": "How to manage API keys",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/cloud/manage-users/api-keys",
  "content": "Create an API key to access Prefect Cloud from a local execution environment.\n\nAPI keys enable you to authenticate a local environment to work with Prefect Cloud.\n\nIf you run `prefect cloud login` from your CLI, you can authenticate through your browser or by pasting an API key.\n\nAuthenticating through the browser directs you to an authorization page.\nAfter you grant approval to connect, you're redirected to the CLI and the API key is saved to your local\n[Prefect profile](/v3/develop/settings-and-profiles/).\n\nIf you choose to authenticate by pasting an API key, you must create an API key in the Prefect Cloud UI first.\n\n## Create an API key\n\n1. Select the account icon at the bottom-left corner of the UI.\n2. Select **API Keys**.\n   The page displays a list of previously generated keys, and allows you to create or delete API keys.\n3. Select the **+** button to create a new API key.\n   Provide a name for the key and an expiration date.\n\n<Warning>\n  Copy the key to a secure location since an API key cannot be revealed again in the UI after it is generated.\n</Warning>\n\n## Log in to Prefect Cloud with an API Key\n\n```bash  theme={null}\nprefect cloud login -k '<my-api-key>'\n```\n\nAlternatively, if you don't have a CLI available - for example, if you are connecting to Prefect Cloud within a remote serverless environment - set the `PREFECT_API_KEY` environment variable.\n\nFor more information see [Connect to Prefect Cloud](/v3/manage/cloud/connect-to-cloud).\n\n## Service account API keys (Pro) (Enterprise)\n\nService accounts are a feature of Prefect Cloud [Pro and Enterprise tier plans](https://www.prefect.io/pricing) that enable you to\ncreate a Prefect Cloud API key that is not associated with a user account.\n\nService accounts are useful for configuring API access for running workers, or executing flow runs on remote infrastructure.\nEvents and logs for flow runs in those environments are associated with the service account rather than a user. Manage or revoke API access by\nconfiguring or removing the service account without disrupting user access.\n\nSee [service accounts](/v3/how-to-guides/cloud/manage-users/service-accounts) for more information.",
  "content_length": 2170
}