{
  "title": "How to manage account roles",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/cloud/manage-users/manage-roles",
  "content": "Configure user workspace roles in Prefect Cloud.\n\nPrefect Cloud's [Pro and Enterprise tiers](https://www.prefect.io/pricing) allow you to set team member\naccess to the appropriate level within specific workspaces.\n\nRole-based access controls (RBAC) enable you to assign users granular permissions to perform certain activities.\n\nEnterprise account administrators can create custom roles for users to give users access to capabilities\nbeyond the scope of Prefect's built-in workspace roles.\n\n## Built-in roles\n\nRoles give users abilities at either the account level or at the individual workspace level.\n\n* An *account-level role* defines a user's default permissions within an account.\n* A *workspace-level role* defines a user's permissions within a specific workspace.\n\nThe following sections outline the abilities of the built-in, Prefect-defined access controls and workspace roles.\n\n### Account-level roles\n\nThe following built-in roles have permissions across an account in Prefect Cloud.\n\n| Role   | Abilities                                                                                                                                                                                                                                                                                                                                                              |\n| ------ | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Owner  | - Set/change all account profile settings allowed to be set/changed by a Prefect user. <br /> - Add and remove account members, and their account roles. <br /> - Create and delete service accounts in the account. <br /> - Create workspaces in the account. <br /> - Implicit workspace owner access on all workspaces in the account. <br /> - Bypass SSO.        |\n| Admin  | - Set/change all account profile settings allowed to be set/changed by a Prefect user. <br /> - Add and remove account members, and their account roles. <br /> - Create and delete service accounts in the account. <br /> - Create workspaces in the account. <br /> - Implicit workspace owner access on all workspaces in the account. <br /> - Cannot bypass SSO. |\n| Member | - View account profile settings. <br /> - View workspaces you have access to in the account. <br /> - View account members and their roles. <br /> - View service accounts in the account.                                                                                                                                                                             |\n\n### Workspace-level roles\n\nThe following built-in roles have permissions within a given workspace in Prefect Cloud.\n\n| Role      | Abilities                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| --------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| Viewer    | - View flow runs within a workspace. <br /> - View deployments within a workspace. <br /> - View all work pools within a workspace. <br /> - View all blocks within a workspace. <br /> - View all automations within a workspace. <br /> - View workspace handle and description.                                                                                                                                                               |\n| Runner    | All Viewer abilities, *plus*: <br /> - Run deployments within a workspace.                                                                                                                                                                                                                                                                                                                                                                       |\n| Developer | All Runner abilities, *plus*: <br /> - Run flows within a workspace. <br /> - Delete flow runs within a workspace. <br /> - Create, edit, and delete deployments within a workspace. <br /> - Create, edit, and delete work pools within a workspace. <br /> - Create, edit, and delete all blocks and their secrets within a workspace. <br /> - Create, edit, and delete automations within a workspace. <br /> - View all workspace settings. |\n| Owner     | All Developer abilities, *plus*: <br /> - Add and remove account members, and set their role within a workspace. <br /> - Set the workspace's default workspace role for all users in the account. <br /> - Set, view, edit workspace settings.                                                                                                                                                                                                  |\n| Worker    | The minimum scopes required for a worker to poll for and submit work.                                                                                                                                                                                                                                                                                                                                                                            |\n\n## Custom workspace roles\n\nThe built-in roles serve the needs of most users, but custom roles give users access to\nspecific permissions within a workspace.\n\nCustom roles can inherit permissions from a built-in role.\nThis enables tweaks to the role to meet your team's needs, while ensuring users still benefit\nfrom Prefect's default workspace role permission curation as new capabilities becomes available.\n\nYou can create custom workspace roles independently of Prefect's built-in roles. This option gives\nworkspace admins full control of user access to workspace capabilities. However, for non-inherited custom roles,\nthe workspace Admin takes on the responsibility for monitoring and setting permissions for new capabilities as it is released.\n\nSee [Role permissions](#workspace-role-permissions) for details of permissions you may set for custom roles.\n\nAfter you create a new role, it becomes available in the account **Members** page and the **Workspace Sharing**\npage for you to apply to users.\n\n### Inherited roles\n\nYou can configure a custom role as an **Inherited Role**. Using an inherited role allows you to create a\ncustom role from a set of initial permissions associated with a built-in Prefect role.\nYou can add additional permissions to the custom role. Permissions included in the inherited role cannot be removed.\n\nCustom roles created from an inherited role follow Prefect's default workspace role permission curation as\nnew capabilities becomes available.\n\nTo configure an inherited role alongside a custom role, select **Inherit permission from a default role**, then select the role from which the new role should inherit permissions.\n\n## Workspace role permissions\n\nThe following permissions are available for custom roles.\n\n### Automations\n\n| Permission                           | Description                                                                                                     |\n| ------------------------------------ | --------------------------------------------------------------------------------------------------------------- |\n| View automations                     | User can see configured automations within a workspace.                                                         |\n| Create, edit, and delete automations | User can create, edit, and delete automations within a workspace. Includes permissions of **View automations**. |\n\n### Blocks\n\n| Permission                      | Description                                                                                                                          |\n| ------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------ |\n| View blocks                     | User can see configured blocks within a workspace.                                                                                   |\n| View secret block data          | User can see configured blocks and their secrets within a workspace. Includes permissions of **View blocks**.                        |\n| Create, edit, and delete blocks | User can create, edit, and delete blocks within a workspace. Includes permissions of **View blocks** and **View secret block data**. |\n\n### Deployments\n\n| Permission                  | Description                                                                                                                                                                                                                                                                                                                                                          |\n| --------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| View deployments            | User can see configured deployments within a workspace.                                                                                                                                                                                                                                                                                                              |\n| Run deployments             | User can run deployments within a workspace. This does not give a user permission to execute the flow associated with the deployment. This only gives a user (through their key) the ability to run a deployment—another user/key must actually execute that flow, such as a service account with an appropriate role. Includes permissions of **View deployments**. |\n| Create and edit deployments | User can create and edit deployments within a workspace. Includes permissions of **View deployments** and **Run deployments**.                                                                                                                                                                                                                                       |\n| Delete deployments          | User can delete deployments within a workspace. Includes permissions of **View deployments**, **Run deployments**, and **Create and edit deployments**.                                                                                                                                                                                                              |\n\n### Flows\n\n| Permission                                      | Description                                                                                                                                            |\n| ----------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| View flows and flow runs                        | User can see flows and flow runs within a workspace.                                                                                                   |\n| Create, update, and delete saved search filters | User can create, update, and delete saved flow run search filters configured within a workspace. Includes permissions of **View flows and flow runs**. |\n| Create, update, and run flows                   | User can create, update, and run flows within a workspace. Includes permissions of **View flows and flow runs**.                                       |\n| Delete flows                                    | User can delete flows within a workspace. Includes permissions of **View flows and flow runs** and **Create, update, and run flows**.                  |\n\n### Notifications\n\n| Permission                            | Description                                                                                                                                                                |\n| ------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| View notification policies            | User can see notification policies configured within a workspace.                                                                                                          |\n| Create and edit notification policies | User can create and edit notification policies configured within a workspace. Includes permissions of **View notification policies**.                                      |\n| Delete notification policies          | User can delete notification policies configured within a workspace. Includes permissions of **View notification policies** and **Create and edit notification policies**. |\n\n### Task run concurrency\n\n| Permission                                  | Description                                                                                                                            |\n| ------------------------------------------- | -------------------------------------------------------------------------------------------------------------------------------------- |\n| View concurrency limits                     | User can see configured task run concurrency limits within a workspace.                                                                |\n| Create, edit, and delete concurrency limits | User can create, edit, and delete task run concurrency limits within a workspace. Includes permissions of **View concurrency limits**. |\n\n### Work pools\n\n| Permission                         | Description                                                                                                                                       |\n| ---------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------- |\n| View work pools                    | User can see work pools configured within a workspace.                                                                                            |\n| Create, edit, and pause work pools | User can create, edit, and pause work pools configured within a workspace. Includes permissions of **View work pools**.                           |\n| Delete work pools                  | User can delete work pools configured within a workspace. Includes permissions of **View work pools** and **Create, edit, and pause work pools**. |\n\n### Workspace management\n\n| Permission                                        | Description                                                                                                       |\n| ------------------------------------------------- | ----------------------------------------------------------------------------------------------------------------- |\n| View information about workspace service accounts | User can see service accounts configured within a workspace.                                                      |\n| View information about workspace users            | User can see user accounts for users invited to the workspace.                                                    |\n| View workspace settings                           | User can see settings configured within a workspace.                                                              |\n| Edit workspace settings                           | User can edit settings for a workspace. Includes permissions of **View workspace settings**.                      |\n| Delete the workspace                              | User can delete a workspace. Includes permissions of **View workspace settings** and **Edit workspace settings**. |",
  "content_length": 17008
}