{
  "title": "How to manage service accounts",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/cloud/manage-users/service-accounts",
  "content": "Workspaces are isolated environments for flows and deployments within Prefect Cloud.\n\nService accounts enable you to create a Prefect Cloud API key that is not associated with a user account.\nService accounts are typically used to configure API access for running workers or executing deployment flow runs on remote infrastructure.\n\nService accounts are non-user accounts that have the following features:\n\n* Prefect Cloud [API keys](/v3/how-to-guides/cloud/manage-users/api-keys)\n* [Roles](/v3/how-to-guides/cloud/manage-users/manage-roles) and permissions\n\nWith service account credentials, you can\n[configure an execution environment](/v3/manage/cloud/connect-to-cloud/#configure-a-local-execution-environment)\nto interact with your Prefect Cloud workspaces without a user manually logging in from that environment.\nService accounts may be created, added to workspaces, have their roles changed, or deleted without affecting other user accounts.\nYou may apply any valid *workspace-level* role to a service account.\n\nSelect **Service Accounts** to view, create, or edit service accounts.\n\nService accounts are created at the account level, but individual workspaces may be shared with the service account.\nSee [workspace sharing](/v3/manage/cloud/workspaces/#workspace-sharing) for more information.\n\n<Tip>\n  **Service account credentials**\n\n  When you create a service account, Prefect Cloud creates a new API key for the account and provides the\n  API configuration command for the execution environment.\n  Save these to a safe location for future use.\n  If the access credentials are lost or compromised, regenerate them from the service account page.\n</Tip>\n\n## Create a service account\n\nOn the **Service Accounts** page, select the **+** icon to create a new service account. Configure:\n\n* The service account name. This name must be unique within your account.\n* An expiration date, or the **Never Expire** option.\n\n<Note>\n  **Service account roles**\n\n  A service account may only be a Member of an account.\n  You may apply any valid *workspace-level* role to a service account when it is\n  [added to a workspace](/v3/manage/cloud/workspaces/#workspace-sharing).\n</Note>\n\nSelect **Create** to create the new service account.\n\n<Warning>\n  Copy the key to a secure location since an API key cannot be revealed again in the UI after it is generated.\n</Warning>\n\nChange the API key and expiration for a service account by rotating the API key.\nSelect **Rotate API Key** from the menu on the left side of the service account's information on this page.\nOptionally, you can set a period of time for your old service account key to remain active.\n\nTo delete a service account, select **Remove** from the menu on the left side of the service account's information.",
  "content_length": 2764
}