{
  "title": "How to troubleshoot Prefect Cloud",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/cloud/troubleshoot-cloud",
  "content": "Learn how to identify and resolve common issues with Prefect Cloud.\n\n## Prefect Cloud and proxies\n\nProxies handle network requests between a server and a client.\n\nTo communicate with Prefect Cloud, the Prefect client library makes HTTPS requests.\nThese requests are made with the [`httpx`](https://www.python-httpx.org/) Python library.\n`httpx` respects accepted proxy environment variables, so the Prefect client can communicate through proxies.\n\nTo enable communication through proxies, set the `HTTPS_PROXY` and `SSL_CERT_FILE` environment\nvariables in your execution environment.\n\nSee the [Using Prefect Cloud with proxies](https://github.com/PrefectHQ/prefect/discussions/16175)\nGitHub Discussion for more information.\n\nYou should whitelist the URLs for the UI, API, Authentication,\nand the current OCSP server for outbound-communication in a secure environment:\n\n* app.prefect.cloud\n* api.prefect.cloud\n* auth.workos.com\n* api.github.com\n* github.com\n* ocsp.pki.goog/s/gts1d4/OxYEb8XcYmo\n\n## Prefect Cloud access through the API\n\nIf the Prefect Cloud API key, environment variable settings, or account login for your execution environment\nare not configured correctly, you may experience errors or unexpected flow run results when using Prefect CLI commands,\nrunning flows, or observing flow run results in Prefect Cloud.\n\nUse the `prefect config view` CLI command to make sure your execution environment is correctly configured\nto access Prefect Cloud:\n\n```bash  theme={null}\n$ prefect config view\nPREFECT_PROFILE='cloud'\nPREFECT_API_KEY='pnu_xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx' (from profile)\nPREFECT_API_URL='https://api.prefect.cloud/api/accounts/...' (from profile)\n```\n\nMake sure `PREFECT_API_URL` is configured to use `https://api.prefect.cloud/api/...`.\n\nMake sure `PREFECT_API_KEY` is configured to use a valid API key.\n\nYou can use the `prefect cloud workspace ls` CLI command to view or set the active workspace.\n\n```bash  theme={null}\nprefect cloud workspace ls\n```\n\n```shell  theme={null}\n┏━━━━━━━━━━━━━━━━━━━━━━━━━┓\n┃   Available Workspaces: ┃\n┡━━━━━━━━━━━━━━━━━━━━━━━━━┩\n│   g-gadflow/g-workspace │\n│    * prefect/workinonit │\n━━━━━━━━━━━━━━━━━━━━━━━━━━━\n    * active workspace\n```\n\nYou can also check that the account and workspace IDs specified in the URL for `PREFECT_API_URL`\nmatch those shown in the URL for your Prefect Cloud workspace.\n\n## Prefect Cloud login errors\n\nIf you're having difficulty logging in to Prefect Cloud, the following troubleshooting steps may resolve the issue,\nor will provide more information when sharing your case to the support channel.\n\n* Are you logging into Prefect Cloud 3? Prefect Cloud 1, Prefect Cloud 2, and Prefect Cloud 3 use separate accounts.\n  Make sure to use the right Prefect Cloud 3 URL: \\<[https://app.prefect.cloud/>](https://app.prefect.cloud/>)\n* Do you already have a Prefect Cloud account? If you're having difficulty accepting an invitation,\n  try creating an account first using the email associated with the invitation, then accept the invitation.\n* Are you using a single sign-on (SSO) provider, social authentication (Google, Microsoft, or GitHub) or just using an emailed link?\n\nOther tips to help with login difficulties:\n\n* Hard refresh your browser with Cmd+Shift+R.\n* Try in a different browser. We actively test against the following browsers:\n  * Chrome\n  * Edge\n  * Firefox\n  * Safari\n* Clear recent browser history/cookies\n\nNone of this worked?\n\nEmail us at \\<[help@prefect.io](mailto:help@prefect.io)> and provide answers to the questions above in your email to make it faster to troubleshoot\nand unblock you. Make sure you add the email address you used to attempt to log in, your Prefect Cloud account name, and, if applicable,\nthe organization it belongs to.\n\n# General troubleshooting\n\nThe first troubleshooting step is to confirm that you are running the latest version of Prefect.\nIf you are not, upgrade (see below) to the latest version, since the issue may have already been fixed.\nBeyond that, there are several categories of errors:\n\n* The issue may be in your flow code, in which case you should carefully read the [logs](#logs).\n* The issue could be with how you are authenticated, and whether or not you are connected to [Cloud](#cloud).\n* The issue might have to do with how your code is [executed](#execution).\n\n## Upgrade\n\nPrefect is constantly evolving by adding new features and fixing bugs. A patch may have already been\nidentified and released. Search existing [issues](https://github.com/PrefectHQ/prefect/issues) for similar reports\nand check out the [Release Notes](https://github.com/PrefectHQ/prefect/releases).\n\nUpgrade to the newest version with the following command:\n\n```bash  theme={null}\npip install --upgrade prefect\n```\n\nDifferent components may use different versions of Prefect:\n\n* **Cloud** is generally the newest version. Cloud is continuously deployed by the Prefect team.\n  When using a self-hosted server, you can control this version.\n* **Workers** change versions infrequently, and are usually the latest version at the time of creation.\n  Workers provision infrastructure for flow runs, so upgrading them may help with infrastructure problems.\n* **Flows** could use a different version than the worker that created them, especially when running in different environments.\n  Suppose your worker and flow both use the latest official Docker image, but your worker was created a month ago.\n  Your worker is often an older version than your flow.\n\n<Note>\n  **Integration Versions**\n\n  [Integrations](/integrations/) are versioned and released independently of the core Prefect library.\n  They should be upgraded simultaneously with the core library, using the same method.\n</Note>\n\n## Logs\n\nIn many cases, there is an informative stack trace in Prefect's [logs](/v3/develop/logging/).\n**Read it carefully**, locate the source of the error, and try to identify the cause.\n\nThere are two types of logs:\n\n* **Flow and task logs** are always scoped to a flow. They are sent to Prefect and are viewable in the UI.\n* **Worker logs** are not scoped to a flow and may have more information on what happened before the flow started.\n  These logs are generally only available where the worker is running.\n\nIf your flow and task logs are empty, there may have been an infrastructure issue that prevented your flow from starting.\nCheck your worker logs for more details.\n\nIf there is no clear indication of what went wrong, try updating the logging level from the default `INFO` level\nto the `DEBUG` level. [Settings](https://reference.prefect.io/prefect/settings/) such as the logging level are propagated\nfrom the worker environment to the flow run environment. Set them with environment variables or the `prefect config set` CLI:\n\n```bash  theme={null}\n# Using the CLI\nprefect config set PREFECT_LOGGING_LEVEL=DEBUG\n\n# Using environment variables\nexport PREFECT_LOGGING_LEVEL=DEBUG\n```\n\nThe `DEBUG` logging level produces a high volume of logs, so consider setting it back to `INFO` once any issues are resolved.\n\n## Cloud\n\nWhen using Prefect Cloud, there are the additional concerns of authentication and authorization.\nThe Prefect API authenticates users and service accounts, collectively known as actors, with API keys.\nMissing, incorrect, or expired API keys result in a 401 response with detail `Invalid authentication credentials`.\nUse the following command to check your authentication, replacing `$PREFECT_API_KEY` with your API key:\n\n```bash  theme={null}\ncurl -s -H \"Authorization: Bearer $PREFECT_API_KEY\" \"https://api.prefect.cloud/api/me/\"\n```\n\n<Note>\n  **Users vs Service Accounts**\n\n  [Service accounts](/v3/how-to-guides/cloud/manage-users/service-accounts) (sometimes referred to as bots),\n  represent non-human actors that interact with Prefect such as workers and CI/CD systems.\n  Each human that interacts with Prefect should be represented as a user.\n  User API keys start with `pnu_` and service account API keys start with `pnb_`.\n</Note>\n\nActors can be members of [workspaces](/v3/manage/cloud/workspaces/). An actor attempting an action in a\nworkspace they are not a member of results in a 404 response. Use the following command to check your actor's workspace memberships:\n\n```bash  theme={null}\ncurl -s -H \"Authorization: Bearer $PREFECT_API_KEY\" \"https://api.prefect.cloud/api/me/workspaces\"\n```\n\n<Note>\n  **Formatting JSON**\n\n  Python comes with a helpful [tool](https://docs.python.org/3/library/json.html#module-json.tool) for formatting JSON.\n  Append the following to the end of the command above to make the output more readable: `| python -m json.tool`\n</Note>\n\nMake sure your actor is a member of the workspace you are working in. Within a workspace,\nan actor has a [role](/v3/how-to-guides/cloud/manage-users/manage-roles) which grants them certain permissions.\nInsufficient permissions result in an error. For example, starting a worker with the **Viewer** role results in errors.\n\n## Execution\n\nThe user can execute flows locally, or remotely by a worker. Local execution generally means that you, the user,\nrun your flow directly with a command like `python flow.py`. Remote execution generally means that a worker runs your flow\nthrough a [deployment](/v3/how-to-guides/deployment_infra/docker) (optionally on different infrastructure).\n\nWith remote execution, the creation of your flow run happens separately from its execution.\nFlow runs are assigned to a work pool and a work queue. For flow runs to execute, a worker must be subscribed\nto the work pool and work queue, or the flow runs will go from `Scheduled` to `Late`.\nEnsure that your work pool and work queue have a subscribed worker.\n\nLocal and remote execution can also differ in their treatment of relative imports.\nIf switching from local to remote execution results in local import errors, try replicating the\nbehavior by executing the flow locally with the `-m` flag (For example, `python -m flow` instead of `python flow.py`).\nRead more about `-m` in this [Stack Overflow post](https://stackoverflow.com/a/62923810).\n\n## API tests return an unexpected 307 Redirected\n\n**Summary:** requests require a trailing `/` in the request URL.\n\nIf you write a test that does not include a trailing `/` when making a request to a specific endpoint:\n\n```python  theme={null}\nasync def test_example(client):\n    response = await client.post(\"/my_route\")\n    assert response.status_code == 201\n```\n\nYou'll see a failure like:\n\n```bash  theme={null}\nE       assert 307 == 201\nE        +  where 307 = <Response [307 Temporary Redirect]>.status_code\n```\n\nTo resolve this, include the trailing `/`:\n\n```python  theme={null}\nasync def test_example(client):\n    response = await client.post(\"/my_route/\")\n    assert response.status_code == 201\n```\n\nNote: requests to nested URLs may exhibit the *opposite* behavior and require no trailing slash:\n\n```python  theme={null}\nasync def test_nested_example(client):\n    response = await client.post(\"/my_route/filter/\")\n    assert response.status_code == 307\n\n    response = await client.post(\"/my_route/filter\")\n    assert response.status_code == 200\n```\n\n**Reference:** \"HTTPX disabled redirect following by default\" in\n[`0.22.0`](https://github.com/encode/httpx/blob/master/CHANGELOG.md#0200-13th-october-2021).\n\n## `pytest.PytestUnraisableExceptionWarning` or `ResourceWarning`\n\nAs you're working with one of the `FlowRunner` implementations, you may get an\nerror like this:\n\n```bash  theme={null}\nE               pytest.PytestUnraisableExceptionWarning: Exception ignored in: <ssl.SSLSocket fd=-1, family=AddressFamily.AF_INET, type=SocketKind.SOCK_STREAM, proto=0>\nE\nE               Traceback (most recent call last):\nE                 File \".../pytest_asyncio/plugin.py\", line 306, in setup\nE                   res = await func(**_add_kwargs(func, kwargs, event_loop, request))\nE               ResourceWarning: unclosed <ssl.SSLSocket fd=10, family=AddressFamily.AF_INET, type=SocketKind.SOCK_STREAM, proto=0, laddr=('127.0.0.1', 60605), raddr=('127.0.0.1', 6443)>\n\n.../_pytest/unraisableexception.py:78: PytestUnraisableExceptionWarning\n\n```\n\nThis error states that your test suite (or the `prefect` library code) opened a\nconnection to something (like a Docker daemon or a Kubernetes cluster) and didn't close\nit.\n\nIt may help to re-run the specific test with `PYTHONTRACEMALLOC=25 pytest ...` so that\nPython can display more of the stack trace where the connection was opened.",
  "content_length": 12445
}