{
  "title": "How to manage workspaces",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/cloud/workspaces",
  "content": "Organize and compartmentalize your workflows with workspaces.\n\nA workspace is a discrete environment within Prefect Cloud for your workflows and related information.\nFor example, you can use separate workspaces to isolate dev, staging, and prod environments, or to provide separation between different teams.\n\n## Get started with workspaces\n\nWhen you first log into Prefect Cloud, you are prompted to create your own workspace.\n\nTo see all workspace workspaces you can access, click on your workspace name in the top of the navigation sidebar.\nTo see all workspace workspaces you can access, click on your workspace name in the top of the navigation sidebar.\n\nYour list of available workspaces may include:\n\n* Your own account's workspace.\n* Workspaces in an account you're invited to with Admin or Member access.\n\nYour user permissions within workspaces may vary. Account admins can assign roles and permissions at the workspace level.\n\n## Create a workspace\n\nOn the Account settings dropdown, select the \"Create a new workspace\" button to create a new workspace.\n\nConfigure:\n\n* The **Workspace Owner** from the dropdown account menu options.\n* A unique **Workspace Name** must be unique within the account.\n* An optional description for the workspace.\n\nSelect **Create** to create the new workspace. The number of available workspaces varies by [Prefect Cloud plan](https://www.prefect.io/pricing/).\nSee [Pricing](https://www.prefect.io/pricing/) if you need additional workspaces or users.\n\n## Control access\n\nWithin a Prefect Cloud Pro or Enterprise tier account, workspace owners can invite other people as members, and provision [service accounts](https://docs.prefect.io/ui/service-accounts/) to a workspace.\nA workspace owner assigns a [workspace role](https://docs.prefect.io/ui/roles/) to the user and specifies the user's scope of permissions within the workspace.\n\nAs a workspace owner, select **Workspaces -> Members** to manage members and **Workspaces -> Service Accounts** and service accounts for the workspace.\nPreviously invited individuals or provisioned service accounts are listed here.\n\nTo invite someone to an account, select the **Members +** icon. You can select from a list of existing account members.\n\nSelect a role for the user. This is the initial role for the user within the workspace.\nA workspace owner can change this role at any time.\n\nTo remove a workspace member, select **Remove** from the menu on the right side of the user information on this page.\n\nTo add a service account to a workspace, select the **Service Accounts +** icon.\nSelect a **Name**, **Account Role**, **Expiration Date**, and optionally, a **Workspace**.\n\nTo update, delete, or rotate the API key for a service account, select an option for an existing service account from the menu on the right side of the service account.\n\n## Transfer a workspace\n\nWorkspace transfer enables you to move an existing workspace from one account to another.\n\nWorkspace transfer retains existing workspace configuration and flow run history, including blocks, deployments, automations, work pools, and logs.\n\n<Note>\n  **Workspace transfer permissions**\n\n  You must have administrator privileges to initiate or approve a workspace transfer.\n\n  To initiate a workspace transfer between personal accounts, contact [support@prefect.io](mailto:support@prefect.io).\n</Note>\n\nClick on the name of your workspace in the sidebar navigation and select **Workspace settings**.\n\nFrom the three dot menu in the upper right of the page, select **Transfer**.\n\nThe **Transfer Workspace** page shows the workspace to be transferred on the left.\nSelect the target account for the workspace on the right.\n\n<Tip>\n  **Workspace transfer impact on accounts**\n\n  Workspace transfer may impact resource usage and costs for source and target accounts.\n\n  When you transfer a workspace, users, API keys, and service accounts may lose access to the workspace.\n  The audit log will no longer track activity on the workspace.\n  Flow runs ending outside of the destination account's flow run retention period will be removed.\n  You may also need to update Prefect CLI profiles and execution environment settings to access the workspace's new location.\n\n  You may incur new charges in the target account to accommodate the transferred workspace.\n</Tip>\n\n## Delete a workspace\n\nDeleting a workspace deletes all of its data including deployments, flow run history, work pools, and automations.\n\nClick on the name of your workspace in the sidebar navigation and select **Workspace settings**.\n\nFrom the three dot menu in the upper right of the page, select **Delete**.",
  "content_length": 4624
}