{
  "title": "How to run Prefect on Windows",
  "source_url": "https://docs-3.prefect.io/v3/how-to-guides/self-hosted/server-windows",
  "content": "Learn how to run Prefect server and workers on Windows with PowerShell.\n\nPrefect provides first-class Windows support with native PowerShell integration and full feature parity with other platforms. This guide covers Windows-specific setup and best practices.\n\n## Windows support\n\nPrefect provides comprehensive Windows support with the Windows ecosystem. Prefect automatically detects PowerShell and uses it as the default shell on Windows, allowing you to run shell commands and scripts naturally without additional configuration. The subprocess execution is fully compatible with Windows process management.\n\nWindows path conventions are fully supported, including UNC paths for network storage. This allows you to configure Prefect to use network shares for databases, storage, and other resources, which is particularly useful in enterprise environments where shared storage is common:\n\n```powershell  theme={null}\n# Configure database on network share using UNC paths\nprefect config set PREFECT_HOME=\"\\\\server\\share\\prefect-data\"\n\n# Or use mapped drives\nprefect config set PREFECT_HOME=\"Z:\\prefect-data\"\n\n# Standard Windows paths work as expected\nprefect config set PREFECT_HOME=\"C:\\ProgramData\\Prefect\"\n```\n\nEnvironment variables work using standard Windows conventions and can be set using PowerShell syntax, either for the current session or permanently for the user:\n\n```powershell  theme={null}\n# Set for current session\n$env:PREFECT_API_DATABASE_TIMEOUT = \"600\"\n\n# Set permanently for user\n[System.Environment]::SetEnvironmentVariable(\"PREFECT_API_DATABASE_TIMEOUT\", \"600\", \"User\")\n```\n\nShell tasks automatically use PowerShell on Windows, providing access to the full Windows command ecosystem:\n\n```python  theme={null}\nfrom prefect import flow\nfrom prefect_shell import shell_run_command\n\n@flow\ndef windows_flow():\n    # This will run in PowerShell by default on Windows\n    result = shell_run_command(command=\"Get-Process prefect\")\n    return result\n```\n\n## Database configuration and workers\n\nBy default, Prefect uses SQLite stored at `%USERPROFILE%\\.prefect\\prefect.db` with no additional configuration needed. For production deployments, you can configure PostgreSQL using standard connection strings:\n\n```powershell  theme={null}\nprefect config set PREFECT_API_DATABASE_CONNECTION_URL=\"postgresql+asyncpg://postgres:password@localhost:5432/prefect\"\n```\n\nPrefect workers on Windows support both process execution and Docker containers. Process workers run flows directly as Windows processes. Docker workers can leverage Windows containers for isolated execution environments:\n\n```powershell  theme={null}\n# Run flows as Windows processes\nprefect worker start --pool my-process-pool --type process\n\n# Use Windows containers with Docker Desktop\ndocker pull mcr.microsoft.com/windows/servercore:ltsc2019\nprefect worker start --pool my-docker-pool --type docker\n```\n\n## Security and performance considerations\n\nWindows environments require specific security configurations for optimal Prefect operation. You'll need to allow Prefect server through Windows Firewall and configure PowerShell execution policies. Additionally, antivirus software can significantly impact performance if not configured properly.\n\nConfigure Windows Firewall to allow Prefect server traffic on port 4200:\n\n```powershell  theme={null}\n# Run as Administrator\nNew-NetFirewallRule -DisplayName \"Prefect Server\" -Direction Inbound -Port 4200 -Protocol TCP -Action Allow\n```\n\nIf you encounter PowerShell execution policy errors when running scripts or deployments, configure the execution policy for the current user:\n\n```powershell  theme={null}\n# Set execution policy for current user\nSet-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser\n```\n\nFor better performance, consider adding these directories to your antivirus exclusions: `%USERPROFILE%\\.prefect\\`, your Python installation directory, and temporary directories used by flows. This prevents real-time scanning from interfering with Prefect operations.\n\n## Production deployment as Windows service\n\nFor production environments, you should run Prefect server as a Windows service to ensure it starts automatically and runs reliably. The Non-Sucking Service Manager (NSSM) is the recommended tool for this purpose. Download NSSM from [nssm.cc](https://nssm.cc) and install the service with administrator privileges:\n\n```powershell  theme={null}\n# Run as Administrator\nnssm install PrefectServer\nnssm set PrefectServer Application \"C:\\Path\\To\\Python\\python.exe\"\nnssm set PrefectServer AppParameters \"-m prefect server start\"\nnssm set PrefectServer AppDirectory \"C:\\Path\\To\\Your\\Project\"\n\n# Set environment variables if needed\nnssm set PrefectServer AppEnvironmentExtra \"PREFECT_API_URL=http://localhost:4200/api\"\n\nnssm start PrefectServer\n```\n\nThis configuration ensures Prefect server starts automatically when Windows boots and provides proper service management capabilities including automatic restarts on failure.\n\n## Troubleshooting common Windows issues\n\nSeveral Windows-specific issues can occur when running Prefect. The most common problems relate to PATH configuration, encoding issues, port conflicts, and permission errors.\n\n### Command not found errors\n\nThese typically indicate PATH issues. Verify that the Python Scripts directory is in your PATH and restart PowerShell after making changes. You can also try running `where prefect` to see if the command is found.\n\nFor example, if the `prefect` command isn't found, you'll need to add the Python Scripts directory to your `PATH`. This is a common issue on Windows when Python isn't installed system-wide:\n\n```powershell  theme={null}\n# Check if Scripts directory is in PATH\n$env:PATH -split ';' | Select-String \"Scripts\"\n\n# Add Scripts directory to PATH (replace with your Python path)\n$scriptsPath = \"C:\\Users\\$env:USERNAME\\AppData\\Local\\Programs\\Python\\Python39\\Scripts\"\n$env:PATH += \";$scriptsPath\"\n```\n\n### Port conflicts\n\nThese can prevent the server from starting. Check what's using port 4200 and kill the process if necessary:\n\n```powershell  theme={null}\n# Check what's using port 4200\nnetstat -ano | findstr :4200\n\n# Kill process if needed (replace PID with actual process ID)\ntaskkill /PID 1234 /F\n```\n\nAlternatively, you can configure Prefect server to use a different port by setting the `PREFECT_SERVER_API_HOST` and `PREFECT_SERVER_API_PORT` environment variables:\n\n```powershell  theme={null}\n# Set server to use port 8080 instead of 4200\n$env:PREFECT_SERVER_API_PORT = \"8080\"\nprefect server start\n\n# Update client configuration to match\nprefect config set PREFECT_API_URL=\"http://127.0.0.1:8080/api\"\n```\n\n### Character encoding errors\n\nCharacter encoding errors (particularly `'charmap' codec` errors) can occur on some Windows systems. Set the Python I/O encoding to UTF-8:\n\n```powershell  theme={null}\n$env:PYTHONIOENCODING = \"UTF-8\"\n```\n\n### Permission errors\n\nPermission errors often require running PowerShell as Administrator for system-wide changes, or checking file permissions on Prefect directories. Network connectivity issues typically involve Windows Firewall rules or corporate proxy settings.\n\n## Additional Resources\n\nFor additional help with Windows-specific issues, check the [Prefect Community Slack](https://prefect.io/slack), search [GitHub Issues](https://github.com/PrefectHQ/prefect/issues) for Windows-related problems, or review PowerShell execution logs for detailed error messages.",
  "content_length": 7451
}