{
  "title": "Contributing",
  "source_url": "https://gofastmcp.com/development/contributing",
  "content": "Development workflow for FastMCP contributors\n\nContributing to FastMCP means joining a community that values clean, maintainable code and thoughtful API design. All contributions are valued - from fixing typos in documentation to implementing major features.\n\n## Issues\n\n### Issue First, Code Second\n\n**Every pull request requires a corresponding issue - no exceptions.** This requirement creates a collaborative space where approach, scope, and alignment are established before code is written. Issues serve as design documents where maintainers and contributors discuss implementation strategy, identify potential conflicts with existing patterns, and ensure proposed changes advance FastMCP's vision.\n\n**FastMCP is an opinionated framework, not a kitchen sink.** The maintainers have strong beliefs about what FastMCP should and shouldn't do. Just because something takes N lines of code and you want it in fewer lines doesn't mean FastMCP should take on the maintenance burden or endorse that pattern. This is judged at the maintainers' discretion.\n\nUse issues to understand scope BEFORE opening PRs. The issue discussion determines whether a feature belongs in core, contrib, or not at all.\n\n### Writing Good Issues\n\nFastMCP is an extremely highly-trafficked repository maintained by a very small team. Issues that appear to transfer burden to maintainers without any effort to validate the problem will be closed. Please help the maintainers help you by always providing a minimal reproducible example and clearly describing the problem.\n\n**LLM-generated issues will be closed immediately.** Issues that contain paragraphs of unnecessary explanation, verbose problem descriptions, or obvious LLM authorship patterns obfuscate the actual problem and transfer burden to maintainers.\n\nWrite clear, concise issues that:\n\n* State the problem directly\n* Provide a minimal reproducible example\n* Skip unnecessary background or context\n* Take responsibility for clear communication\n\nIssues may be labeled \"Invalid\" simply due to confusion caused by verbosity or not adhering to the guidelines outlined here.\n\n## Pull Requests\n\nPRs that deviate from FastMCP's core principles will be rejected regardless of implementation quality. **PRs are NOT for iterating on ideas** - they should only be opened for ideas that already have a bias toward acceptance based on issue discussion.\n\n### Development Environment\n\n#### Installation\n\nTo contribute to FastMCP, you'll need to set up a development environment with all necessary tools and dependencies.\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# Clone the repository\ngit clone https://github.com/jlowin/fastmcp.git\ncd fastmcp\n\n# Install all dependencies including dev tools\nuv sync\n\n# Install prek hooks\nuv run prek install\n```\n\nIn addition, some development commands require [just](https://github.com/casey/just) to be installed.\n\nPrek hooks will run automatically on every commit to catch issues before they reach CI. If you see failures, fix them before committing - never commit broken code expecting to fix it later.\n\n### Development Standards\n\n#### Scope\n\nLarge pull requests create review bottlenecks and quality risks. Unless you're fixing a discrete bug or making an incredibly well-scoped change, keep PRs small and focused.\n\nA PR that changes 50 lines across 3 files can be thoroughly reviewed in minutes. A PR that changes 500 lines across 20 files requires hours of careful analysis and often hides subtle issues.\n\nBreaking large features into smaller PRs:\n\n* Creates better review experiences\n* Makes git history clear\n* Simplifies debugging with bisect\n* Reduces merge conflicts\n* Gets your code merged faster\n\n#### Code Quality\n\nFastMCP values clarity over cleverness. Every line you write will be maintained by someone else - possibly years from now, possibly without context about your decisions.\n\n**PRs can be rejected for two opposing reasons:**\n\n1. **Insufficient quality** - Code that doesn't meet our standards for clarity, maintainability, or idiomaticity\n2. **Overengineering** - Code that is overbearing, unnecessarily complex, or tries to be too clever\n\nThe focus is on idiomatic, high-quality Python. FastMCP uses patterns like `NotSet` type as an alternative to `None` in certain situations - follow existing patterns.\n\n#### Required Practices\n\n**Full type annotations** on all functions and methods. They catch bugs before runtime and serve as inline documentation.\n\n**Async/await patterns** for all I/O operations. Even if your specific use case doesn't need concurrency, consistency means users can compose features without worrying about blocking operations.\n\n**Descriptive names** make code self-documenting. `auth_token` is clear; `tok` requires mental translation.\n\n**Specific exception types** make error handling predictable. Catching `ValueError` tells readers exactly what error you expect. Never use bare `except` clauses.\n\n#### Anti-Patterns to Avoid\n\n**Complex one-liners** are hard to debug and modify. Break operations into clear steps.\n\n**Mutable default arguments** cause subtle bugs. Use `None` as the default and create the mutable object inside the function.\n\n**Breaking established patterns** confuses readers. If you must deviate, discuss in the issue first.\n\n### Prek Checks\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# Runs automatically on commit, or manually:\nuv run prek run --all-files\n```\n\nThis runs three critical tools:\n\n* **Ruff**: Linting and formatting\n* **Prettier**: Code formatting\n* **ty**: Static type checking\n\nPytest runs separately as a distinct workflow step after prek checks pass. CI will reject PRs that fail these checks. Always run them locally first.\n\n### Testing\n\nTests are documentation that shows how features work. Good tests give reviewers confidence and help future maintainers understand intent.\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# Run specific test directory\nuv run pytest tests/server/ -v\n\n# Run all tests before submitting PR\nuv run pytest\n```\n\nEvery new feature needs tests. See the [Testing Guide](/development/tests) for patterns and requirements.\n\n### Documentation\n\nA feature doesn't exist unless it's documented. Note that FastMCP's hosted documentation always tracks the main branch - users who want historical documentation can clone the repo, checkout a specific tag, and host it themselves.\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# Preview documentation locally\njust docs\n```\n\nDocumentation requirements:\n\n* **Explain concepts in prose first** - Code without context is just syntax\n* **Complete, runnable examples** - Every code block should be copy-pasteable\n* **Register in docs.json** - Makes pages appear in navigation\n* **Version badges** - Mark when features were added using `<VersionBadge />`\n\n#### SDK Documentation\n\nFastMCP's SDK documentation is auto-generated from the source code docstrings and type annotations. It is automatically updated on every merge to main by a GitHub Actions workflow, so users are *not* responsible for keeping the documentation up to date. However, to generate it proactively, you can use the following command:\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\njust api-ref-all\n```\n\n### Submitting Your PR\n\n#### Before Submitting\n\n1. **Run all checks**: `uv run prek run --all-files && uv run pytest`\n2. **Keep scope small**: One feature or fix per PR\n3. **Write clear description**: Your PR description becomes permanent documentation\n4. **Update docs**: Include documentation for API changes\n\n#### PR Description\n\nWrite PR descriptions that explain:\n\n* What problem you're solving\n* Why you chose this approach\n* Any trade-offs or alternatives considered\n* Migration path for breaking changes\n\nFocus on the \"why\" - the code shows the \"what\". Keep it concise but complete.\n\n#### What We Look For\n\n**Framework Philosophy**: FastMCP is NOT trying to do all things or provide all shortcuts. Features are rejected when they don't align with the framework's vision, even if perfectly implemented. The burden of proof is on the PR to demonstrate value.\n\n**Code Quality**: We verify code follows existing patterns. Consistency reduces cognitive load. When every module works similarly, developers understand new code quickly.\n\n**Test Coverage**: Not every line needs testing, but every behavior does. Tests document intent and protect against regressions.\n\n**Breaking Changes**: May be acceptable in minor versions but must be clearly documented. See the [versioning policy](/development/releases#versioning-policy).\n\n## Special Modules\n\n**`contrib`**: Community-maintained patterns and utilities. Original authors maintain their contributions. Not representative of the core framework.\n\n**`experimental`**: Maintainer-developed features that may preview future functionality. Can break or be deleted at any time without notice. Pin your FastMCP version when using these features.",
  "content_length": 8996
}