{
  "title": "Releases",
  "source_url": "https://gofastmcp.com/development/releases",
  "content": "FastMCP versioning and release process\n\nFastMCP releases frequently to deliver features quickly in the rapidly evolving MCP ecosystem. We use semantic versioning pragmatically - the Model Context Protocol is young, patterns are still emerging, and waiting for perfect stability would mean missing opportunities to empower developers with better tools.\n\n## Versioning Policy\n\n### Semantic Versioning\n\n**Major (x.0.0)**: Complete API redesigns\n\nMajor versions represent fundamental shifts. FastMCP 2.x is entirely different from 1.x in both implementation and design philosophy.\n\n**Minor (2.x.0)**: New features and evolution\n\n<Warning>\n  Unlike traditional semantic versioning, minor versions **may** include [breaking changes](#breaking-changes) when necessary for the ecosystem's evolution. This flexibility is essential in a young ecosystem where perfect backwards compatibility would prevent important improvements.\n</Warning>\n\nFastMCP always targets the most current MCP Protocol version. Breaking changes in the MCP spec or MCP SDK automatically flow through to FastMCP - we prioritize staying current with the latest features and conventions over maintaining compatibility with older protocol versions.\n\n**Patch (2.0.x)**: Bug fixes and refinements\n\nPatch versions contain only bug fixes without breaking changes. These are safe updates you can apply with confidence.\n\n### Breaking Changes\n\nWe permit breaking changes in minor versions because the MCP ecosystem is rapidly evolving. Refusing to break problematic APIs would accumulate design debt that eventually makes the framework unusable. Each breaking change represents a deliberate decision to keep FastMCP aligned with the ecosystem's evolution.\n\nWhen breaking changes occur:\n\n* They only happen in minor versions (e.g., 2.3.x to 2.4.0)\n* Release notes explain what changed and how to migrate\n* We provide deprecation warnings at least 1 minor version in advance when possible\n* Changes must substantially benefit users to justify disruption\n\nThe public API is what's covered by our compatibility guarantees - these are the parts of FastMCP you can rely on to remain stable within a minor version. The public API consists of:\n\n* `FastMCP` server class, `Client` class, and FastMCP `Context`\n* Core MCP components: `Tool`, `Prompt`, `Resource`, `ResourceTemplate`, and transports\n* Their public methods and documented behaviors\n\nEverything else (utilities, private methods, internal modules) may change without notice. This boundary lets us refactor internals and improve implementation details without breaking your code. For production stability, pin to specific versions.\n\n<Warning>\n  The `fastmcp.server.auth` module was introduced in 2.12.0 and is exempted from this policy temporarily, meaning it is *expected* to have breaking changes even on patch versions. This is because auth is a rapidly evolving part of the MCP spec and it would be dangerous to be beholden to old decisions. Please pin your FastMCP version if using authentication in production.\n\n  We expect this exemption to last through at least the 2.12.x and 2.13.x release series.\n</Warning>\n\n### Production Use\n\nPin to exact versions:\n\n```\nfastmcp==2.11.0  # Good\nfastmcp>=2.11.0  # Bad - will install breaking changes\n```\n\n## Creating Releases\n\nOur release process is intentionally simple:\n\n1. Create GitHub release with tag `vMAJOR.MINOR.PATCH` (e.g., `v2.11.0`)\n2. Generate release notes automatically, and curate or add additional editorial information as needed\n3. GitHub releases automatically trigger PyPI deployments\n\nThis automation lets maintainers focus on code quality rather than release mechanics.\n\n### Release Cadence\n\nWe follow a feature-driven release cadence rather than a fixed schedule. Minor versions ship approximately every 3-4 weeks when significant functionality is ready.\n\nPatch releases ship promptly for:\n\n* Critical bug fixes\n* Security updates (immediate release)\n* Regression fixes\n\nThis approach means you get improvements as soon as they're ready rather than waiting for arbitrary release dates.",
  "content_length": 4061
}