{
  "title": "Upgrade Guide",
  "source_url": "https://gofastmcp.com/development/upgrade-guide",
  "content": "Migration instructions for upgrading between FastMCP versions\n\nThis guide provides migration instructions for breaking changes and major updates when upgrading between FastMCP versions.\n\n## v2.13.0\n\n### OAuth Token Key Management\n\nThe OAuth proxy now issues its own JWT tokens to clients instead of forwarding upstream provider tokens. This improves security by maintaining proper token audience boundaries.\n\n**What changed:**\n\nThe OAuth proxy now implements a token factory pattern - it receives tokens from your OAuth provider (GitHub, Google, etc.), encrypts and stores them, then issues its own FastMCP JWT tokens to clients. This requires cryptographic keys for JWT signing and token encryption.\n\n**Default behavior (development):**\n\nBy default, FastMCP automatically manages keys based on your platform:\n\n* **Mac/Windows**: Keys are auto-managed via system keyring, surviving server restarts with zero configuration. Suitable **only** for development and local testing.\n* **Linux**: Keys are ephemeral (random salt at startup, regenerated on each restart).\n\nThis works fine for development and testing where re-authentication after restart is acceptable.\n\n**For production:**\n\nProduction deployments must provide explicit keys and use persistent storage. Add these three things:\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nauth = GitHubProvider(\n    client_id=os.environ[\"GITHUB_CLIENT_ID\"],\n    client_secret=os.environ[\"GITHUB_CLIENT_SECRET\"],\n    base_url=\"https://your-server.com\",\n\n    # Explicit keys (required for production)\n    jwt_signing_key=os.environ[\"JWT_SIGNING_KEY\"],\n\n    # Persistent network storage (required for production)\n    client_storage=RedisStore(host=\"redis.example.com\", port=6379)\n)\n```\n\n**More information:**\n\n* [OAuth Token Security](/deployment/http#oauth-token-security) - Complete production setup guide\n* [Key and Storage Management](/servers/auth/oauth-proxy#key-and-storage-management) - Detailed explanation of defaults and production requirements\n* [OAuth Proxy Parameters](/servers/auth/oauth-proxy#configuration-parameters) - Parameter documentation",
  "content_length": 2125
}