{
  "title": "Authentication",
  "source_url": "https://gofastmcp.com/servers/auth/authentication",
  "content": "Secure your FastMCP server with flexible authentication patterns, from simple API keys to full OAuth 2.1 integration with external identity providers.\n\nexport const VersionBadge = ({version}) => {\n  return <code className=\"version-badge-container\">\n            <p className=\"version-badge\">\n                <span className=\"version-badge-label\">New in version:</span> \n                <code className=\"version-badge-version\">{version}</code>\n            </p>\n        </code>;\n};\n\n<VersionBadge version=\"2.11.0\" />\n\nAuthentication in MCP presents unique challenges that differ from traditional web applications. MCP clients need to discover authentication requirements automatically, negotiate OAuth flows without user intervention, and work seamlessly across different identity providers. FastMCP addresses these challenges by providing authentication patterns that integrate with the MCP protocol while remaining simple to implement and deploy.\n\n<Tip>\n  Authentication applies only to FastMCP's HTTP-based transports (`http` and `sse`). The STDIO transport inherits security from its local execution environment.\n</Tip>\n\n<Warning>\n  **Authentication is rapidly evolving in MCP.** The specification and best practices are changing quickly. FastMCP aims to provide stable, secure patterns that adapt to these changes while keeping your code simple and maintainable.\n</Warning>\n\n## MCP Authentication Challenges\n\nTraditional web authentication assumes a human user with a browser who can interact with login forms and consent screens. MCP clients are often automated systems that need to authenticate without human intervention. This creates several unique requirements:\n\n**Automatic Discovery**: MCP clients must discover authentication requirements by examining server metadata rather than encountering login redirects.\n\n**Programmatic OAuth**: OAuth flows must work without human interaction, relying on pre-configured credentials or Dynamic Client Registration.\n\n**Token Management**: Clients need to obtain, refresh, and manage tokens automatically across multiple MCP servers.\n\n**Protocol Integration**: Authentication must integrate cleanly with MCP's transport mechanisms and error handling.\n\nThese challenges mean that not all authentication approaches work well with MCP. The patterns that do work fall into three categories based on the level of authentication responsibility your server assumes.\n\n## Authentication Responsibility\n\nAuthentication responsibility exists on a spectrum. Your MCP server can validate tokens created elsewhere, coordinate with external identity providers, or handle the complete authentication lifecycle internally. Each approach involves different trade-offs between simplicity, security, and control.\n\n### Token Validation\n\nYour server validates tokens but delegates their creation to external systems. This approach treats your MCP server as a pure resource server that trusts tokens signed by known issuers.\n\nToken validation works well when you already have authentication infrastructure that can issue structured tokens like JWTs. Your existing API gateway, microservices platform, or enterprise SSO system becomes the source of truth for user identity, while your MCP server focuses on its core functionality.\n\nThe key insight is that token validation separates authentication (proving who you are) from authorization (determining what you can do). Your MCP server receives proof of identity in the form of a signed token and makes access decisions based on the claims within that token.\n\nThis pattern excels in microservices architectures where multiple services need to validate the same tokens, or when integrating MCP servers into existing systems that already handle user authentication.\n\n### External Identity Providers\n\nYour server coordinates with established identity providers to create seamless authentication experiences for MCP clients. This approach leverages OAuth 2.0 and OpenID Connect protocols to delegate user authentication while maintaining control over authorization decisions.\n\nExternal identity providers handle the complex aspects of authentication: user credential verification, multi-factor authentication, account recovery, and security monitoring. Your MCP server receives tokens from these trusted providers and validates them using the provider's public keys.\n\nThe MCP protocol's support for Dynamic Client Registration makes this pattern particularly powerful. MCP clients can automatically discover your authentication requirements and register themselves with your identity provider without manual configuration.\n\nThis approach works best for production applications that need enterprise-grade authentication features without the complexity of building them from scratch. It scales well across multiple applications and provides consistent user experiences.\n\n### Full OAuth Implementation\n\nYour server implements a complete OAuth 2.0 authorization server, handling everything from user credential verification to token lifecycle management. This approach provides maximum control at the cost of significant complexity.\n\nFull OAuth implementation means building user interfaces for login and consent, implementing secure credential storage, managing token lifecycles, and maintaining ongoing security updates. The complexity extends beyond initial implementation to include threat monitoring, compliance requirements, and keeping pace with evolving security best practices.\n\nThis pattern makes sense only when you need complete control over the authentication process, operate in air-gapped environments, or have specialized requirements that external providers cannot meet.\n\n## FastMCP Authentication Providers\n\nFastMCP translates these authentication responsibility levels into a variety of concrete classes that handle the complexities of MCP protocol integration. You can build on these classes to handle the complexities of MCP protocol integration.\n\n### TokenVerifier\n\n`TokenVerifier` provides pure token validation without OAuth metadata endpoints. This class focuses on the essential task of determining whether a token is valid and extracting authorization information from its claims.\n\nThe implementation handles JWT signature verification, expiration checking, and claim extraction. It validates tokens against known issuers and audiences, ensuring that tokens intended for your server are not accepted by other systems.\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nfrom fastmcp import FastMCP\nfrom fastmcp.server.auth.providers.jwt import JWTVerifier\n\nauth = JWTVerifier(\n    jwks_uri=\"https://your-auth-system.com/.well-known/jwks.json\",\n    issuer=\"https://your-auth-system.com\", \n    audience=\"your-mcp-server\"\n)\n\nmcp = FastMCP(name=\"Protected Server\", auth=auth)\n```\n\nThis example configures token validation against a JWT issuer. The `JWTVerifier` will fetch public keys from the JWKS endpoint and validate incoming tokens against those keys. Only tokens with the correct issuer and audience claims will be accepted.\n\n`TokenVerifier` works well when you control both the token issuer and your MCP server, or when integrating with existing JWT-based infrastructure.\n\n→ **Complete guide**: [Token Verification](/servers/auth/token-verification)\n\n### RemoteAuthProvider\n\n`RemoteAuthProvider` enables authentication with identity providers that **support Dynamic Client Registration (DCR)**, such as Descope and WorkOS AuthKit. With DCR, MCP clients can automatically register themselves with the identity provider and obtain credentials without any manual configuration.\n\nThis class combines token validation with OAuth discovery metadata. It extends `TokenVerifier` functionality by adding OAuth 2.0 protected resource endpoints that advertise your authentication requirements. MCP clients examine these endpoints to understand which identity providers you trust and how to obtain valid tokens.\n\nThe key requirement is that your identity provider must support DCR - the ability for clients to dynamically register and obtain credentials. This is what enables the seamless, automated authentication flow that MCP requires.\n\nFor example, the built-in `AuthKitProvider` uses WorkOS AuthKit, which fully supports DCR:\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nfrom fastmcp import FastMCP\nfrom fastmcp.server.auth.providers.workos import AuthKitProvider\n\nauth = AuthKitProvider(\n    authkit_domain=\"https://your-project.authkit.app\",\n    base_url=\"https://your-fastmcp-server.com\"\n)\n\nmcp = FastMCP(name=\"Enterprise Server\", auth=auth)\n```\n\nThis example uses WorkOS AuthKit as the external identity provider. The `AuthKitProvider` automatically configures token validation against WorkOS and provides the OAuth metadata that MCP clients need for automatic authentication.\n\n`RemoteAuthProvider` is ideal for production applications when your identity provider supports Dynamic Client Registration (DCR). This enables fully automated authentication without manual client configuration.\n\n→ **Complete guide**: [Remote OAuth](/servers/auth/remote-oauth)\n\n### OAuthProxy\n\n<VersionBadge version=\"2.12.0\" />\n\n`OAuthProxy` enables authentication with OAuth providers that **don't support Dynamic Client Registration (DCR)**, such as GitHub, Google, Azure, AWS, and most traditional enterprise identity systems.\n\nWhen identity providers require manual app registration and fixed credentials, `OAuthProxy` bridges the gap. It presents a DCR-compliant interface to MCP clients (accepting any registration request) while using your pre-registered credentials with the upstream provider. The proxy handles the complexity of callback forwarding, enabling dynamic client callbacks to work with providers that require fixed redirect URIs.\n\nThis class solves the fundamental incompatibility between MCP's expectation of dynamic registration and traditional OAuth providers' requirement for manual app registration.\n\nFor example, the built-in `GitHubProvider` extends `OAuthProxy` to work with GitHub's OAuth system:\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nfrom fastmcp import FastMCP\nfrom fastmcp.server.auth.providers.github import GitHubProvider\n\nauth = GitHubProvider(\n    client_id=\"Ov23li...\",  # Your GitHub OAuth App ID\n    client_secret=\"abc123...\",  # Your GitHub OAuth App Secret\n    base_url=\"https://your-server.com\"\n)\n\nmcp = FastMCP(name=\"GitHub-Protected Server\", auth=auth)\n```\n\nThis example uses the GitHub provider, which extends `OAuthProxy` with GitHub-specific token validation. The proxy handles the complete OAuth flow while making GitHub's non-DCR authentication work seamlessly with MCP clients.\n\n`OAuthProxy` is essential when integrating with OAuth providers that don't support DCR. This includes most established providers like GitHub, Google, and Azure, which require manual app registration through their developer consoles.\n\n→ **Complete guide**: [OAuth Proxy](/servers/auth/oauth-proxy)\n\n### OAuthProvider\n\n`OAuthProvider` implements a complete OAuth 2.0 authorization server within your MCP server. This class handles the full authentication lifecycle from user credential verification to token management.\n\nThe implementation provides all required OAuth endpoints including authorization, token, and discovery endpoints. It manages client registration, user consent, and token lifecycle while integrating with your user storage and authentication logic.\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nfrom fastmcp import FastMCP\nfrom fastmcp.server.auth.providers.oauth import MyOAuthProvider\n\nauth = MyOAuthProvider(\n    user_store=your_user_database,\n    client_store=your_client_registry,\n    # Additional configuration...\n)\n\nmcp = FastMCP(name=\"Auth Server\", auth=auth)\n```\n\nThis example shows the basic structure of a custom OAuth provider. The actual implementation requires significant additional configuration for user management, client registration, and security policies.\n\n`OAuthProvider` should be used only when you have specific requirements that external providers cannot meet and the expertise to implement OAuth securely.\n\n→ **Complete guide**: [Full OAuth Server](/servers/auth/full-oauth-server)\n\n## Configuration Approaches\n\nFastMCP supports both programmatic configuration for maximum flexibility and environment-based configuration for deployment simplicity.\n\n### Programmatic Configuration\n\nProgrammatic configuration provides complete control over authentication settings and allows for complex initialization logic. This approach works well during development and when you need to customize authentication behavior based on runtime conditions.\n\nAuthentication providers are instantiated directly in your code with their required parameters. This makes dependencies explicit and allows your IDE to provide helpful autocompletion and type checking.\n\n### Environment Configuration\n\n<VersionBadge version=\"2.12.1\" />\n\nEnvironment-based configuration separates authentication settings from application code, enabling the same codebase to work across different deployment environments without modification.\n\nFastMCP automatically detects authentication configuration from environment variables when no explicit `auth` parameter is provided. The configuration system supports all authentication providers and their various options.\n\n#### Provider Configuration\n\nAuthentication providers are configured by specifying the full module path to the provider class:\n\n<ParamField path=\"FASTMCP_SERVER_AUTH\" type=\"string\">\n  The full module path to the authentication provider class. Examples:\n\n  * `fastmcp.server.auth.providers.github.GitHubProvider` - GitHub OAuth\n  * `fastmcp.server.auth.providers.google.GoogleProvider` - Google OAuth\n  * `fastmcp.server.auth.providers.jwt.JWTVerifier` - JWT token verification\n  * `fastmcp.server.auth.providers.workos.WorkOSProvider` - WorkOS OAuth\n  * `fastmcp.server.auth.providers.workos.AuthKitProvider` - WorkOS AuthKit\n  * `mycompany.auth.CustomProvider` - Your custom provider class\n</ParamField>\n\nWhen using providers like GitHub or Google, you'll need to set provider-specific environment variables:\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# GitHub OAuth\nexport FASTMCP_SERVER_AUTH=fastmcp.server.auth.providers.github.GitHubProvider\nexport FASTMCP_SERVER_AUTH_GITHUB_CLIENT_ID=\"Ov23li...\"\nexport FASTMCP_SERVER_AUTH_GITHUB_CLIENT_SECRET=\"github_pat_...\"\n\n# Google OAuth\nexport FASTMCP_SERVER_AUTH=fastmcp.server.auth.providers.google.GoogleProvider\nexport FASTMCP_SERVER_AUTH_GOOGLE_CLIENT_ID=\"123456.apps.googleusercontent.com\"\nexport FASTMCP_SERVER_AUTH_GOOGLE_CLIENT_SECRET=\"GOCSPX-...\"\n```\n\n#### Provider-Specific Configuration\n\nEach provider has its own configuration options set through environment variables:\n\n```bash  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\n# JWT Token Verification\nexport FASTMCP_SERVER_AUTH=fastmcp.server.auth.providers.jwt.JWTVerifier\nexport FASTMCP_SERVER_AUTH_JWT_JWKS_URI=\"https://auth.example.com/jwks\"\nexport FASTMCP_SERVER_AUTH_JWT_ISSUER=\"https://auth.example.com\"\nexport FASTMCP_SERVER_AUTH_JWT_AUDIENCE=\"mcp-server\"\n\n# Custom Provider\nexport FASTMCP_SERVER_AUTH=mycompany.auth.CustomProvider\n# Plus any environment variables your custom provider expects\n```\n\nWith these environment variables set, creating an authenticated FastMCP server requires no additional configuration:\n\n```python  theme={\"theme\":{\"light\":\"snazzy-light\",\"dark\":\"dark-plus\"}}\nfrom fastmcp import FastMCP\n\n# Authentication automatically configured from environment\nmcp = FastMCP(name=\"My Server\")\n```\n\nThis approach simplifies deployment pipelines and follows twelve-factor app principles for configuration management.\n\n## Choosing Your Implementation\n\nThe authentication approach you choose depends on your existing infrastructure, security requirements, and operational constraints.\n\n**For OAuth providers without DCR support (GitHub, Google, Azure, AWS, most enterprise systems), use OAuth Proxy.** These providers require manual app registration through their developer consoles. OAuth Proxy bridges the gap by presenting a DCR-compliant interface to MCP clients while using your fixed credentials with the provider. The proxy's callback forwarding pattern enables dynamic client ports to work with providers that require fixed redirect URIs.\n\n**For identity providers with DCR support (Descope, WorkOS AuthKit, modern auth platforms), use RemoteAuthProvider.** These providers allow clients to dynamically register and obtain credentials without manual configuration. This enables the fully automated authentication flow that MCP is designed for, providing the best user experience and simplest implementation.\n\n**Token validation works well when you already have authentication infrastructure that issues structured tokens.** If your organization already uses JWT-based systems, API gateways, or enterprise SSO that can generate tokens, this approach integrates seamlessly while keeping your MCP server focused on its core functionality. The simplicity comes from leveraging existing investment in authentication infrastructure.\n\n**Full OAuth implementation should be avoided unless you have compelling reasons that external providers cannot address.** Air-gapped environments, specialized compliance requirements, or unique organizational constraints might justify this approach, but it requires significant security expertise and ongoing maintenance commitment. The complexity extends far beyond initial implementation to include threat monitoring, security updates, and keeping pace with evolving attack vectors.\n\nFastMCP's architecture supports migration between these approaches as your requirements evolve. You can integrate with existing token systems initially and migrate to external identity providers as your application scales, or implement custom solutions when your requirements outgrow standard patterns.",
  "content_length": 17963
}