{
  "title": "Key Concepts",
  "source_url": null,
  "content": "> Understanding Zep's context engineering platform and temporal knowledge graphs.\n\n<Tip>\n  Looking to just get coding? Check out our [Quickstart](/quickstart).\n</Tip>\n\nZep is a context engineering platform that systematically assembles personalized context—user preferences, traits, and business data—for reliable agent applications. Zep combines Graph RAG, agent memory, and context assembly capabilities to deliver comprehensive personalized context that reduces hallucinations and improves accuracy.\n\n## Concepts Table\n\n| Concept                                    | Description                                                                                                                                                                                                           | Docs                                                              |\n| ------------------------------------------ | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ----------------------------------------------------------------- |\n| Knowledge Graph                            | Zep's unified knowledge store for agents. Nodes represent entities, edges represent facts/relationships. The graph updates dynamically in response to new data.                                                       | [Docs](/understanding-the-graph)                                  |\n| Zep's Context Block                        | Optimized string containing a user summary and facts from the knowledge graph most relevant to the current thread. Also contains dates when facts became valid and invalid. Provide this to your chatbot as \"memory\". | [Docs](/retrieving-memory#zeps-context-block)                     |\n| Fact Invalidation                          | When new data invalidates a prior fact, the time the fact became invalid is stored on that fact's edge in the knowledge graph.                                                                                        | [Docs](/facts)                                                    |\n| JSON/text/message                          | Types of data that can be ingested into the knowledge graph. Can represent business data, documents, chat messages, emails, etc.                                                                                      | [Docs](/adding-data-to-the-graph)                                 |\n| Custom Entity/Edge Types                   | Feature allowing use of Pydantic-like classes to customize creation/retrieval of entities and relations in the knowledge graph.                                                                                       | [Docs](/customizing-graph-structure#custom-entity-and-edge-types) |\n| Graph                                      | Represents an arbitrary knowledge graph for storing up-to-date knowledge about an object or system. For storing up-to-date knowledge about a user, a user graph should be used.                                       | [Docs](/graph-overview)                                           |\n| User Graph                                 | Special type of graph for storing personalized memory for a user of your application.                                                                                                                                 | [Docs](/users)                                                    |\n| User                                       | A user in Zep represents a user of your application, and has its own User Graph and thread history.                                                                                                                   | [Docs](/users)                                                    |\n| Threads                                    | Conversation threads of a user. By default, all messages added to any thread of that user are ingested into that user's graph.                                                                                        | [Docs](/threads)                                                  |\n| `graph.add` & `thread.add_messages`        | Methods for adding data to a graph and user graph respectively.                                                                                                                                                       | [Docs](/adding-data-to-the-graph) [Docs](/memory#adding-memory)   |\n| `graph.search` & `thread.get_user_context` | Low level and high level methods respectively for retrieving from the knowledge graph.                                                                                                                                | [Docs](/searching-the-graph) [Docs](/memory#retrieving-memory)    |\n| User Summary Instructions                  | Customize how Zep generates entity summaries for users in their knowledge graph. Up to 5 custom instructions per user to guide summary generation.                                                                    | [Docs](/users#user-summary-instructions)                          |\n| Agentic Tool                               | Use Zep's memory retrieval methods as agentic tools, enabling your agent to query for relevant information from the user's knowledge graph.                                                                           | [Docs](/quickstart#use-zep-as-an-agentic-tool)                    |\n\n## Use Cases Table\n\n| Use case          | Purpose                                                                  | Implementation                                                                                                                                                                                                                                                                                     |\n| ----------------- | ------------------------------------------------------------------------ | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Dynamic Graph RAG | Provide your agent with up-to-date knowledge of an object/system         | Add/stream all relevant data to a Graph ([docs](/adding-data-to-the-graph)), chunking first if needed ([docs](/adding-data-to-the-graph#data-size-limit-and-chunking)), and retrieve from the graph by constructing a custom context block ([docs](/cookbook/advanced-context-block-construction)) |\n| Agent memory      | Provide your agent with up-to-date knowledge of a user                   | Add/stream user messages and user business data to a User Graph ([docs](/adding-memory)), and retrieve user memory as the context block returned from `thread.get_user_context` ([docs](/retrieving-memory)), and provide this context block to your agent before responding                       |\n| Voice agents      | Provide up-to-date knowledge with extremely low latency to a voice agent | Similar to other implementations, except incorporating latency optimizations ([docs](/performance))                                                                                                                                                                                                |\n\n## What is Context Engineering?\n\nContext Engineering is the discipline of assembling all necessary information, instructions, and tools around a LLM to help it accomplish tasks reliably. Unlike simple prompt engineering, context engineering involves building dynamic systems that provide the right information in the right format so LLMs can perform consistently.\n\nThe core challenge: LLMs are stateless and only know what's in their immediate context window. Context engineering bridges this gap by systematically providing relevant background knowledge, user history, business data, and tool outputs.\n\nUsing [business data and/or user chat histories](#business-data-vs-chat-message-data), Zep automatically constructs a [temporal knowledge graph](/graph-overview) to reflect the state of an object/system or a user. The knowledge graph contains entities, relationships, and facts related to your object/system or user. As facts change or are superseded, [Zep updates the graph](#managing-changes-in-facts-over-time) to reflect their new state. Through systematic context engineering, Zep provides your agent with the comprehensive information needed to deliver personalized responses and solve problems. This reduces hallucinations, improves accuracy, and reduces the cost of LLM calls.\n\n<lite-vimeo videoid=\"1021963693\" />\n\n## How Zep Fits Into Your Application\n\nYour application sends Zep business data (JSON, unstructured text) and/or messages. Business data sources may include CRM applications, emails, billing data, or conversations on other communication platforms like Slack.\n\n<Frame>\n  <img src=\"file:8c1f9ad5-a2a4-4484-8487-acb600053954\" />\n</Frame>\n\nZep automatically fuses this data together on a temporal knowledge graph, building a holistic view of the object/system or user and the relationships between entities. Zep offers a number of APIs for [adding and retrieving memory](#retrieving-memory). In addition to populating a prompt with Zep's engineered context, Zep's search APIs can be used to build [agentic tools](#using-zep-as-an-agentic-tool).\n\nThe example below shows Zep's `memory.context` field resulting from a call to `thread.get_user_context()`. This is Zep's engineered context block that can be added to your prompt and contains a user summary and facts relevant to the current conversation with a user. For more about the temporal context of facts, see [Managing changes in facts over time](#managing-changes-in-facts-over-time).\n\n### Context Block\n\n[Zep's Context Block](/retrieving-memory#zeps-context-block) is Zep's engineered context string containing a user summary and relevant facts for the thread. It is always present in the result of `thread.get_user_context()`\ncall and can be optionally [received with the response of `thread.add_messages()` call](/performance#get-the-context-block-sooner).\n\nThe Context Block provides low latency (P95 \\< 200ms) while preserving detailed information from the user's graph. Read more about Zep's Context Block [here](/retrieving-memory#zeps-context-block).\n\n<CodeBlocks>\n  ```python Python\n  # Get memory for the thread\n  memory = client.thread.get_user_context(thread_id=thread_id)\n\n  # Access the context block (for use in prompts)\n  context_block = memory.context\n  print(context_block)\n  ```\n\n  ```typescript TypeScript\n  // Get memory for the thread\n  const memory = await client.thread.getUserContext(threadId);\n\n  // Access the context block (for use in prompts)\n  const contextBlock = memory.context;\n  console.log(contextBlock);\n  ```\n\n  ```go Go\n  import (\n      \"context\"\n      v3 \"github.com/getzep/zep-go/v3\"\n  )\n\n  // Get memory for the thread\n  memory, err := client.Thread.GetUserContext(context.TODO(), threadId, nil)\n  if err != nil {\n      log.Fatal(\"Error getting memory:\", err)\n  }\n  // Access the context block (for use in prompts)\n  contextBlock := memory.Context\n  fmt.Println(contextBlock)\n  ```\n</CodeBlocks>\n\nThe Context Block includes a user summary and relevant facts:\n\n```text\n### This is the user summary\n<USER_SUMMARY>\nEmily Painter is a user with account ID Emily0e62 who uses digital art tools for creative work. She maintains an active account with the service, though has recently experienced technical issues with the Magic Pen Tool. Emily values reliable payment processing and seeks prompt resolution for account-related issues. She expects clear communication and efficient support when troubleshooting technical problems.\n</USER_SUMMARY>\n\n### These are the most relevant facts and their valid date ranges\n### format: FACT (Date range: from - to)\n<FACTS>\n  - Emily is experiencing issues with logging in. (2024-11-14 02:13:19+00:00 - present)\n  - User account Emily0e62 has a suspended status due to payment failure. (2024-11-14 02:03:58+00:00 - present)\n  - user has the id of Emily0e62 (2024-11-14 02:03:54 - present)\n  - The failed transaction used a card with last four digits 1234. (2024-09-15 00:00:00+00:00 - present)\n  - The reason for the transaction failure was 'Card expired'. (2024-09-15 00:00:00+00:00 - present)\n  - user has the name of Emily Painter (2024-11-14 02:03:54 - present)\n  - Account Emily0e62 made a failed transaction of 99.99. (2024-07-30 00:00:00+00:00 - 2024-08-30 00:00:00+00:00)\n</FACTS>\n```\n\nYou can then include this context in your system prompt:\n\n| MessageType | Content                                                |\n| ----------- | ------------------------------------------------------ |\n| `System`    | Your system prompt <br /> <br /> `{Zep context block}` |\n| `Assistant` | An assistant message stored in Zep                     |\n| `User`      | A user message stored in Zep                           |\n| ...         | ...                                                    |\n| `User`      | The latest user message                                |",
  "content_length": 13273
}