{
  "title": "Retrieval philosophy",
  "source_url": null,
  "content": "> Understanding Zep's approach to optimizing for recall and latency.\n\nZep's retrieval system is designed with two primary goals: **high recall** and **low latency**. This is a deliberate architectural choice that differs from systems optimized for precision.\n\n## Understanding recall vs. precision\n\nThink of recall and precision as two different ways to measure retrieval quality:\n\n* **Recall** measures completeness: \"Did we find all the relevant information?\"\n* **Precision** measures accuracy: \"Is everything we returned actually relevant?\"\n\nIn practical terms:\n\n* **High recall** means you get all the relevant results, but might also get some less relevant ones\n* **High precision** means everything returned is highly relevant, but you might miss important information\n\n## The tradeoff in practice\n\n| Approach                                 | What You Get                                        | What You Risk                                        | Best For                                                                        |\n| ---------------------------------------- | --------------------------------------------------- | ---------------------------------------------------- | ------------------------------------------------------------------------------- |\n| **Optimize for Recall** (Zep's approach) | All relevant facts, plus some less relevant results | Larger context with some noise                       | Agents that need complete information to make decisions; real-time applications |\n| **Optimize for Precision**               | Only highly relevant results                        | Missing critical facts that could cause task failure | Use cases where context size is severely constrained; manual review workflows   |\n\n### Example scenario\n\nUser query: *\"What did we discuss about the Q2 marketing budget?\"*\n\n| Retrieval Approach         | Results Returned                                                                                                                                             | Outcome                                                                                                                                                                             |\n| -------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------ | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Recall-Optimized** (Zep) | • Q2 marketing budget discussion ✓<br />• Related Q2 sales projections ✓<br />• Q3 budget planning mention ⚠️<br />• Q2 hiring costs mentioning marketing ⚠️ | Agent has complete context, including tangentially related information. Can successfully answer follow-up questions about budget revisions.                                         |\n| **Precision-Optimized**    | • Q2 marketing budget discussion ✓<br />• Related Q2 sales projections ✓                                                                                     | Clean, focused results, but **missing** a separate conversation about budget revisions that didn't explicitly mention \"marketing budget.\" Agent may provide incomplete information. |\n\n## Why recall over precision?\n\nAgents need comprehensive context to make informed decisions. Missing a critical fact can cause an agent to fail its task or provide incorrect information. By optimizing for recall, Zep ensures that relevant information is available to the agent, even if that means returning more results than strictly necessary.\n\nThe underlying principle: it's better to provide complete information and let the agent or downstream LLM filter what's relevant than to risk omitting something important.\n\n## Why latency matters\n\nReal-time applications like conversational AI, live customer support, and interactive agents require fast responses. Zep's retrieval architecture is optimized to return results in milliseconds, enabling seamless user experiences without perceptible delays.\n\n## Tuning the recall-precision tradeoff\n\nThe recall-optimized approach described here is how Zep is tuned **out of the box**. However, Zep provides several mechanisms to adjust this tradeoff for different use cases:\n\n* **Limit search results**: Control the maximum number of results returned\n* **Apply filters**: Narrow retrieval to specific time ranges, Entity and/or Edge labels, or other criteria\n* **Adjust search parameters**: Fine-tune ranking and relevance thresholds\n\nThese controls allow you to shift toward precision when your application demands it, while maintaining Zep's fast retrieval performance.\n\n## Balancing context size\n\nWhile recall is our priority, Zep does consider token count when returning results. We balance the size of the resulting context with the goal of providing complete information, but when in doubt, we err on the side of ensuring your agent has what it needs to succeed.",
  "content_length": 5039
}