{
  "title": "Graph Overview",
  "source_url": null,
  "content": "Zep's temporal knowledge graph powers its context engineering capabilities, including agent memory and Graph RAG. Zep's graph is built on [Graphiti](/graphiti/graphiti/overview), Zep's open-source temporal graph library, which is fully integrated into Zep. Developers do not need to interact directly with Graphiti or understand its underlying implementation.\n\n<Card title=\"What is a Knowledge Graph?\" icon=\"duotone chart-network\">\n  A knowledge graph is a network of interconnected facts, such as *\"Kendra loves\n  Adidas shoes.\"* Each fact is a *\"triplet\"* represented by two entities, or\n  nodes (*\"Kendra\", \"Adidas shoes\"*), and their relationship, or edge\n  (*\"loves\"*).\n\n  <br />\n\n  Knowledge Graphs have been explored extensively for information retrieval.\n  What makes Zep unique is its ability to autonomously build temporal knowledge graphs\n  while handling changing relationships and maintaining historical context.\n</Card>\n\nZep automatically constructs a temporal knowledge graph for each of your users. The knowledge graph contains entities, relationships, and facts related to your user, while automatically handling changing relationships and facts over time.\n\nHere's an example of how Zep might extract graph data from a chat message, and then update the graph once new information is available:\n\n![graphiti intro slides](file:cb9d38f7-c214-45fb-9a18-0f77a3a3ccb0)\n\nEach node and edge contains certain attributes - notably, a fact is always stored as an edge attribute. There are also datetime attributes for when the fact becomes valid and when it becomes invalid.\n\n## Graph Data Structure\n\nZep's graph database stores data in three main types:\n\n1. Entity edges (edges): Represent relationships between nodes and include semantic facts representing the relationship between the edge's nodes.\n2. Entity nodes (nodes): Represent entities extracted from episodes, containing summaries of relevant information.\n3. Episodic nodes (episodes): Represent raw data stored in Zep, either through chat history or the `graph.add` endpoint.\n\n## Creating a Graph\n\nBefore you can work with graph data, you need to create a graph. Each graph is identified by a unique `graph_id` and can optionally include a name and description:\n\n<CodeBlocks>\n  ```python Python\n  from zep_cloud import Zep\n\n  client = Zep(api_key=\"YOUR_API_KEY\")\n\n  graph = client.graph.create(\n      graph_id=\"unique-graph-id\",\n      name=\"Graph Name\",\n      description=\"This is a description.\"\n  )\n  ```\n\n  ```typescript TypeScript\n  import { ZepClient } from \"zep-cloud\";\n\n  const client = new ZepClient({ apiKey: \"YOUR_API_KEY\" });\n\n  const graph = await client.graph.create({\n      graphId: \"unique-graph-id\",\n      name: \"Graph Name\",\n      description: \"This is a description.\"\n  });\n  ```\n\n  ```go Go\n  import (\n      \"context\"\n      \"fmt\"\n      \"log\"\n      \"github.com/getzep/zep-go/v3\"\n      v3client \"github.com/getzep/zep-go/v3/client\"\n      \"github.com/getzep/zep-go/v3/option\"\n  )\n\n  client := v3client.NewClient(\n      option.WithAPIKey(\"YOUR_API_KEY\"),\n  )\n\n  name := \"Graph Name\"\n  description := \"This is a description.\"\n\n  graph, err := client.Graph.Create(context.TODO(), &v3.CreateGraphRequest{\n      GraphID:     \"unique-graph-id\",\n      Name:        &name,\n      Description: &description,\n  })\n  if err != nil {\n      log.Fatal(\"Error creating graph:\", err)\n  }\n\n  fmt.Println(\"Graph created:\", graph)\n  ```\n</CodeBlocks>\n\n## Working with the Graph\n\nTo learn more about interacting with Zep's graph, refer to the following sections:\n\n* [Adding Data to the Graph](/v3/adding-data-to-the-graph): Learn how to add new data to the graph.\n* [Reading Data from the Graph](/v3/reading-data-from-the-graph): Discover how to retrieve information from the graph.\n* [Searching the Graph](/v3/searching-the-graph): Explore techniques for efficiently searching the graph.\n\nThese guides will help you leverage the full power of Zep's knowledge graph in your applications.",
  "content_length": 3950
}