{
  "title": "Utilizing Facts and Summaries",
  "source_url": null,
  "content": "> Facts and summaries are extracted from the chat history as a conversation unfolds as well as from business data added to Zep.\n\n## Facts\n\nFacts are precise and time-stamped information stored on [edges](/sdk-reference/graph/edge/get) that capture detailed relationships about specific events. They include `valid_at` and `invalid_at` timestamps, ensuring temporal accuracy and preserving a clear history of changes over time.\n\n### How Zep Updates Facts\n\nWhen incorporating new data, Zep looks for existing nodes and edges in the graph and decides whether to add new nodes/edges or to update existing ones. An update could mean updating an edge (for example, indicating the previous fact is no longer valid).\n\nHere's an example of how Zep might extract graph data from a chat message, and then update the graph once new information is available:\n\n![graphiti intro slides](file:cb9d38f7-c214-45fb-9a18-0f77a3a3ccb0)\n\nAs shown in the example above, when Kendra initially loves Adidas shoes but later is angry that the shoes broke and states a preference for Puma shoes, Zep attempts to invalidate the fact that Kendra loves Adidas shoes and creates two new facts: \"Kendra's Adidas shoes broke\" and \"Kendra likes Puma shoes\".\n\nZep also looks for dates in all ingested data, such as the timestamp on a chat message or an article's publication date, informing how Zep sets the edge attributes. This assists your agent in reasoning with time.\n\n### The Four Fact Timestamps\n\nEach fact stored on an edge includes four different timestamp attributes that track the lifecycle of that information:\n\n| Edge attribute  | Example                                         |\n| :-------------- | :---------------------------------------------- |\n| **created\\_at** | The time Zep learned that the user got married  |\n| **valid\\_at**   | The time the user got married                   |\n| **invalid\\_at** | The time the user got divorced                  |\n| **expired\\_at** | The time Zep learned that the user got divorced |\n\nThe `valid_at` and `invalid_at` attributes for each fact are then included in Zep's Context Block which is given to your agent:\n\n```text\n### format: FACT (Date range: from - to)\nUser account Emily0e62 has a suspended status due to payment failure. (2024-11-14 02:03:58+00:00 - present)\n```\n\n## Summaries\n\nSummaries are high-level overviews of entities or concepts stored on [nodes](/sdk-reference/graph/node/get). They provide a broad snapshot of an entity or concept and its relationships to other nodes. Summaries offer an aggregated and concise representation, making it easier to understand key information at a glance.\n\n<Tip title=\"Choosing Between Facts and Summaries\">\n  Zep does not recommend relying solely on summaries for grounding LLM responses. While summaries provide a high-level overview, the [Context Block](/retrieving-memory#zeps-context-block) should be used since it includes relevant facts (each with valid and invalid timestamps). This ensures that conversations are based on up-to-date and contextually accurate information.\n</Tip>\n\n## Adding or Deleting Facts or Summaries\n\nFacts and summaries are generated as part of the ingestion process. If you follow the directions for [adding data to the graph](/adding-data-to-the-graph), new facts and summaries will be created.\n\nDeleting facts and summaries is handled by deleting data from the graph. Facts and summaries will be deleted when you [delete the edge or node](/deleting-data-from-the-graph) they exist on.\n\n***\n\n## \\[DEPRECATED] Rating Facts for Relevancy\n\n<Warning>\n  **This feature is deprecated.** Fact ratings have been replaced by [user summary instructions](/users#user-summary-instructions), which provide a more flexible and effective way to customize how Zep prioritizes and presents user information.\n\n  We recommend using user summary instructions instead of fact ratings for new implementations.\n</Warning>\n\n### Rating Facts for Relevancy\n\nNot all relevant facts are equally important to your specific use-case. For example, a relationship coach app may need to recall important facts about a user's family, but what the user ate for breakfast Friday last week is unimportant.\n\nFact ratings are a way to help Zep understand the importance of relevant facts to your particular use case. After implementing fact ratings, you can specify a `minRating` when retrieving relevant facts from Zep, ensuring that the memory `context` string contains customized content.\n\n#### Implementing Fact Ratings\n\nThe `fact_rating_instruction` framework consists of an instruction and three example facts, one for each of a `high`, `medium`, and `low` rating.  These are passed when [Adding a User graph](/sdk-reference/user/add) or [Adding a graph](/sdk-reference/graph/create) and become a property of the Graph.\n\n#### Example: Fact Rating Implementation\n\n<CodeBlocks>\n  ```python Rating Facts for Poignancy\n  fact_rating_instruction = \"\"\"Rate the facts by poignancy. Highly poignant \n  facts have a significant emotional impact or relevance to the user. \n  Facts with low poignancy are minimally relevant or of little emotional\n  significance.\"\"\"\n  fact_rating_examples = FactRatingExamples(\n      high=\"The user received news of a family member's serious illness.\",\n      medium=\"The user completed a challenging marathon.\",\n      low=\"The user bought a new brand of toothpaste.\",\n  )\n  client.user.add(\n      user_id=user_id,\n      fact_rating_instruction=FactRatingInstruction(\n          instruction=fact_rating_instruction,\n          examples=fact_rating_examples,\n      ),\n  )\n  ```\n\n  ```python Use Case-Specific Fact Rating\n  client.user.add(\n      user_id=user_id,\n      fact_rating_instruction=FactRatingInstruction(\n          instruction=\"\"\"Rate the facts by how relevant they \n                         are to purchasing shoes.\"\"\",\n          examples=FactRatingExamples(\n              high=\"The user has agreed to purchase a Reebok running shoe.\",\n              medium=\"The user prefers running to cycling.\",\n              low=\"The user purchased a dress.\",\n          ),\n      ),\n  )\n  ```\n</CodeBlocks>\n\nAll facts are rated on a scale between 0 and 1.\n\n#### Limiting Memory Recall to High-Rating Facts\n\nYou can filter the facts that will make it into the context block by setting the `minRating` parameter in [Get User Context](/sdk-reference/thread/get-user-context#request.query.minRating.minRating).\n\n```python\nresult = client.thread.get_user_context(thread_id, min_rating=0.7)\n```",
  "content_length": 6480
}