{
  "title": "Role-Based Access Control",
  "source_url": null,
  "content": "<Warning>\n  Early access only. Contact your Zep account team to enable RBAC for your workspace.\n</Warning>\n\n<Info>\n  Available to [Enterprise Plan](https://www.getzep.com/pricing) customers only.\n</Info>\n\n## Overview\n\nRole-based access control (RBAC) lets you grant the right level of access to each teammate while keeping sensitive account actions limited to trusted users. RBAC grants permissions through roles, and every member can hold multiple assignments across the account and individual projects.\n\n## Scopes and authorizations\n\nRBAC permissions are evaluated at two scopes:\n\n* **Account scope:** Covers organization-wide settings such as member management, billing, and account-level API keys, along with full access to every project.\n* **Project scope:** Grants permissions for a single project, including its data plane, collaborators, and project-specific API keys, without exposing other projects or global settings.\n\nAuthorizations are grouped into the following capability areas. These appear in the dashboard when you review role details.\n\n* `account.view.readonly` — View account-level configuration, billing status, and usage.\n* `rbac.account.manage` — Create, update, or delete account-scoped role assignments, including promoting additional Account Owners.\n* `rbac.project.manage` — Manage project-scoped assignments and project-level resources (API keys, data ingestion, deletion) for the projects a member administers.\n\n## Roles\n\nThe early access catalog includes account-wide roles and project-scoped roles. Assignments can be combined so that, for example, a teammate can be an Account Admin and a Project Viewer on a sensitive project.\n\n<Info>\n  Non-Enterprise plans can assign Account Owner and Account Admin roles. Upgrade to Enterprise to unlock project-level roles and granular account roles (Billing Admin, Account Viewer, Project Creator).\n</Info>\n\n### Account-level roles\n\n| Role                | Scope   | Intended for                          | Key authorizations                                                                                                                                                                                                                                                                        |\n| ------------------- | ------- | ------------------------------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Account Owner**   | Account | Founders, security administrators     | `account.view.readonly`, `rbac.account.manage`, `rbac.project.manage`<br />Manage billing and plan settings.<br />Create, update, and archive projects.<br />Rotate account and project API keys.<br />Assign or revoke any role, including other Account Owners.                         |\n| **Account Admin**   | Account | Day-to-day operators who run projects | `account.view.readonly`, `rbac.project.manage`<br />Create and manage projects and API keys.<br />Ingest or delete memory, documents, and graph data.<br />Assign and revoke project-scoped roles for any project.<br />Cannot remove the last Account Owner or change billing ownership. |\n| **Billing Admin**   | Account | Finance or procurement partners       | `billing.manage`<br />View invoices and update payment details.<br />No access to project data or member management.                                                                                                                                                                      |\n| **Account Viewer**  | Account | Compliance and audit reviewers        | `account.view.readonly`, `project.data.read`, `apikey.view`<br />Read account details, project metadata, and API keys.<br />Cannot make configuration changes.                                                                                                                            |\n| **Project Creator** | Account | Builders who bootstrap new projects   | `project.create`<br />Create new projects from the dashboard.<br />No access to existing projects unless separately assigned.                                                                                                                                                             |\n\n### Project-level roles\n\n| Role               | Scope   | Intended for                                    | Key authorizations                                                                                                                                                                |\n| ------------------ | ------- | ----------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| **Project Admin**  | Project | Team leads who manage a single project          | `rbac.project.manage` for the assigned project only.<br />Invite or remove project collaborators.<br />Create and rotate project API keys.<br />Ingest and delete project data.   |\n| **Project Editor** | Project | Data engineers or agents that need write access | Read and write all project data, including memory, documents, and graph content.<br />Use project API keys to ingest or delete data.<br />Cannot assign roles or manage API keys. |\n| **Project Viewer** | Project | Analysts, auditors, or embedded stakeholders    | View project configuration, usage, threads, documents, and graph content.<br />Run read-only queries and exports.<br />Cannot ingest, delete, or manage API keys.                 |\n\n## Managing role assignments\n\n* Use the **Settings ▸ Access Control** page in the Zep Dashboard to add or remove roles. Search for an existing member or invite a new teammate, then assign any combination of account and project roles.\n* Filter by project to focus on project-scoped roles, or view the full access matrix to understand overlapping assignments.\n* Every member must have at least one Account Owner assigned. Attempts to delete the final Account Owner are rejected.\n* The dashboard prevents duplicate assignments for the same member, scope, and project.\n* Removing a role hides it from the active list but keeps the history available; you can restore access later by adding the role again.",
  "content_length": 6452
}