{
  "title": "FAQ",
  "source_url": null,
  "content": "## Is there a free version of Zep Cloud?\n\nYes - Zep offers a free tier. See [Pricing](https://www.getzep.com/pricing) for more information.\n\n## What is the API URL for Zep Cloud?\n\nThe API URL for Zep Cloud is `https://api.getzep.com`. Note that you do not need to specify the API URL when using the Cloud SDKs.\nIf a service requests the Zep URL, it is possible it's only compatible with the Zep Community Edition service.\n\n## Does Zep Cloud support multiple spoken languages?\n\nWe have official multilingual support on our roadmap, enabling the creation of graphs in a user's own language. Currently, graphs are not explicitly created in the user's language. However, Zep should work well today with any language, provided you're using a multilingual LLM and your own prompts explicitly state that responses to the user should be in their language.\n\n## I can't join my company project, because I have already created an account. What should I do?\n\nYou will need to delete your account and then accept the invitation from your company.\n\n## How well does Zep scale?\n\nZep supports many millions of users per account and retrieval performance is not impacted by dataset size. Retrieving/searching the graph scales in near constant time with the size of the graph. Zep's Metered Billing Plan is subject to rate limits on both API requests and processing concurrency.\n\n## Is there a limit on the number of graphs I can create?\n\nNo, there is no limit on the number of graphs you can create.\n\n## Is there a limit on the size of the graph?\n\nNo, there is no limit on the size of the graph.\n\n## Can I use Zep to replace RAG over static documents?\n\nZep can be used for retrieval for static documents just like RAG or GraphRAG, although this is not what Zep was designed for. Zep was designed for dynamic, changing data, which RAG and GraphRAG were not designed to do.\n\n## How does the retrieval work for thread.get\\_user\\_context under the hood?\n\n`thread.get_user_context` does a `graph.search` on nodes, edges, and episodes using the [MMR reranker](/searching-the-graph#mmr-maximal-marginal-relevance). It uses the most recent message as the search query. In addition, it does a `BFS` on the 4 most recent episodes (so it finds all nodes, edges, and episodes created by the 4 most recent episodes and all nodes and edges 2 connections deep).\n\nAll of those search results are then used as candidate results which are reranked by the [MMR reranker](/searching-the-graph#mmr-maximal-marginal-relevance). The MMR reranker will compare each search result with the most recent 4 messages to determine how relevant that result is to the current conversation.\n\n## I am seeing information duplicated between different node summaries. Is this normal?\n\nThis is a normal and intended feature of Zep. Node summaries are intended to be standalone summaries of the node, which often means describing the relationships that that node has to other nodes. Those same relationships are likely to appear in the summaries of those other nodes.\n\n## Should I use nodes, edges, or episodes when searching the graph and creating a context string?\n\nYou can use any combination of nodes, edges, and episodes. There is not a one size fits all solution, and you will likely need to experiment with different approaches to get the best performance for your use case.\n\n## Where is the data stored? What if my client needs it stored in the EU?\n\nWe only offer US data residency currently.\n\n## Can I self host Zep? What happened to Zep Community Edition?\n\nZep Community Edition, which allows you to host Zep locally, is deprecated and no longer supported. See our [announcement post here](https://blog.getzep.com/announcing-a-new-direction-for-zeps-open-source-strategy/).\n\nThe alternatives we offer include:\n\n* [Zep Cloud](https://www.getzep.com/): Our hosted solution\n* [Graphiti](https://github.com/getzep/graphiti): The open source knowledge graph that powers Zep Cloud\n\n## How do I get Zep to work with n8n?\n\nThe Zep n8n integration is no longer supported. We recommend using Zep's SDKs directly instead, see [here](https://help.getzep.com/quickstart).\n\n## Why aren't my episodes processing?\n\nSometimes episodes may appear to not be processing when they are actually processing slowly. Typically, episodes process in less than 10 seconds, but occasionally they can take a few minutes. Additionally, if you add multiple episodes to a single graph simultaneously, they must process sequentially, which can take time if there are many episodes.\n\nPlease confirm the following:\n\n* Are you adding multiple episodes to a single graph all at once? If so, how many? Multiply the number of episodes you are adding to a single graph by 10 seconds for an average case time estimate, or by a few minutes for a worst case time estimate.\n* If the above is the case, within the web app, find the most recently processed episode and then look at the next unprocessed episode. Confirm whether that episode remains unprocessed after waiting at least 3-4 minutes (the worst-case processing time). If you see this episode process after some waiting, then your episodes are processing, it just may take some time.\n* If neither of the above applies, reach out to our support team on [Discord](https://discord.com/invite/W8Kw6bsgXQ) and let them know what you are seeing.\n\n## How do I get the playground to work with my own data?\n\nThe playground is not meant to work with custom data. Instead the playground showcases Zep's functionality with demo data. In order to create a graph with your own custom data, you need to use the Zep SDKs. See our [Quickstart](/quickstart).\n\n## How do I add messages or create memory for a group chat with multiple people?\n\nIn order to add messages for a group chat to a Zep knowledge graph, you need to use the `graph.add` method with `type = message` as opposed to `thread.add_messages` (which uses `graph.add` with `type = message` under the hood). You need to use the `graph.add` method so that you are not associating the chat with a single user. Then, to retrieve memory, you need to search the graph and assemble a custom context block ([see cookbook example](/cookbook/advanced-context-block-construction)).\n\n## What's the difference between Zep and Graphiti?\n\nSee our detailed comparison: [Zep vs Graphiti](/zep-vs-graphiti)",
  "content_length": 6300
}