{
  "title": "Searching the Graph",
  "source_url": null,
  "content": "> How to retrieve information from your Graphiti graph\n\nThe examples below demonstrate two search approaches in the Graphiti library:\n\n1. **Hybrid Search:**\n\n   ```python\n   await graphiti.search(query)\n   ```\n\n   Combines semantic similarity and BM25 retrieval, reranked using Reciprocal Rank Fusion.\n\n   Example: Does a broad retrieval of facts related to Allbirds Wool Runners and Jane's purchase.\n\n2. **Node Distance Reranking:**\n\n   ```python\n   await graphiti.search(query, focal_node_uuid)\n   ```\n\n   Extends Hybrid Search above by prioritizing results based on proximity to a specified node in the graph.\n\n   Example: Focuses on Jane-specific information, highlighting her wool allergy.\n\nNode Distance Reranking is particularly useful for entity-specific queries, providing more contextually relevant results. It weights facts by their closeness to the focal node, emphasizing information directly related to the entity of interest.\n\nThis dual approach allows for both broad exploration and targeted, entity-specific information retrieval from the knowledge graph.\n\n```python\nquery = \"Can Jane wear Allbirds Wool Runners?\"\njane_node_uuid = \"123e4567-e89b-12d3-a456-426614174000\"\n\ndef print_facts(edges):\n    print(\"\\n\".join([edge.fact for edge in edges]))\n\n### Hybrid Search\nresults = await graphiti.search(query)\nprint_facts(results)\n\n> The Allbirds Wool Runners are sold by Allbirds.\n> Men's SuperLight Wool Runners - Dark Grey (Medium Grey Sole) has a runner silhouette.\n> Jane purchased SuperLight Wool Runners.\n\n### Hybrid Search with Node Distance Reranking\nawait client.search(query, jane_node_uuid)\nprint_facts(results)\n\n> Jane purchased SuperLight Wool Runners.\n> Jane is allergic to wool.\n> The Allbirds Wool Runners are sold by Allbirds.\n```\n\n## Configurable Search Strategies\n\nGraphiti also provides a low-level search method that is more configurable than the out-of-the-box search.\nThis search method can be called using `graphiti._search()` and passing in an additional config parameter of type `SearchConfig`.\n`SearchConfig` contains 4 fields: one for the limit, and three more configs for each of edges, nodes, and communities.\nThe `graphiti._search()` method returns a `SearchResults` object containing a list of nodes, edges, and communities.\n\nThe `graphiti._search()` method is quite configurable and can be complicated to work with at first.\nAs such, we also have a `search_config_recipes.py` file that contains a few prebuilt `SearchConfig` recipes for common use cases.\n\nThe 15 recipes are the following:\n\n| Search Type                               | Description                                                                                                               |\n| ----------------------------------------- | ------------------------------------------------------------------------------------------------------------------------- |\n| COMBINED\\_HYBRID\\_SEARCH\\_RRF             | Performs a hybrid search with RRF reranking over edges, nodes, and communities.                                           |\n| COMBINED\\_HYBRID\\_SEARCH\\_MMR             | Performs a hybrid search with MMR reranking over edges, nodes, and communities.                                           |\n| COMBINED\\_HYBRID\\_SEARCH\\_CROSS\\_ENCODER  | Performs a full-text search, similarity search, and BFS with cross\\_encoder reranking over edges, nodes, and communities. |\n| EDGE\\_HYBRID\\_SEARCH\\_RRF                 | Performs a hybrid search over edges with RRF reranking.                                                                   |\n| EDGE\\_HYBRID\\_SEARCH\\_MMR                 | Performs a hybrid search over edges with MMR reranking.                                                                   |\n| EDGE\\_HYBRID\\_SEARCH\\_NODE\\_DISTANCE      | Performs a hybrid search over edges with node distance reranking.                                                         |\n| EDGE\\_HYBRID\\_SEARCH\\_EPISODE\\_MENTIONS   | Performs a hybrid search over edges with episode mention reranking.                                                       |\n| EDGE\\_HYBRID\\_SEARCH\\_CROSS\\_ENCODER      | Performs a hybrid search over edges with cross encoder reranking.                                                         |\n| NODE\\_HYBRID\\_SEARCH\\_RRF                 | Performs a hybrid search over nodes with RRF reranking.                                                                   |\n| NODE\\_HYBRID\\_SEARCH\\_MMR                 | Performs a hybrid search over nodes with MMR reranking.                                                                   |\n| NODE\\_HYBRID\\_SEARCH\\_NODE\\_DISTANCE      | Performs a hybrid search over nodes with node distance reranking.                                                         |\n| NODE\\_HYBRID\\_SEARCH\\_EPISODE\\_MENTIONS   | Performs a hybrid search over nodes with episode mentions reranking.                                                      |\n| NODE\\_HYBRID\\_SEARCH\\_CROSS\\_ENCODER      | Performs a hybrid search over nodes with cross encoder reranking.                                                         |\n| COMMUNITY\\_HYBRID\\_SEARCH\\_RRF            | Performs a hybrid search over communities with RRF reranking.                                                             |\n| COMMUNITY\\_HYBRID\\_SEARCH\\_MMR            | Performs a hybrid search over communities with MMR reranking.                                                             |\n| COMMUNITY\\_HYBRID\\_SEARCH\\_CROSS\\_ENCODER | Performs a hybrid search over communities with cross encoder reranking.                                                   |\n\n## Supported Reranking Approaches\n\n**Reciprocal Rank Fusion (RRF)** enhances search by combining results from different algorithms, like BM25 and semantic search. Each algorithm's results are ranked, converted to reciprocal scores (1/rank), and summed. This aggregated score determines the final ranking, leveraging the strengths of each method for more accurate retrieval.\n\n**Maximal Marginal Relevance (MMR)** is a search strategy that balances relevance and diversity in results. It selects results that are both relevant to the query and diverse from already chosen ones, reducing redundancy and covering different query aspects. MMR ensures comprehensive and varied search results by iteratively choosing results that maximize relevance while minimizing similarity to previously selected results.\n\nA **Cross-Encoder** is a model that jointly encodes a query and a result, scoring their relevance by considering their combined context. This approach often yields more accurate results compared to methods that encode query and a text separately.\n\nGraphiti supports three cross encoders:\n\n* `OpenAIRerankerClient` (the default) - Uses an OpenAI model to classify relevance and the resulting `logprobs` are used to rerank results.\n* `GeminiRerankerClient` - Uses Google's Gemini models to classify relevance for cost-effective and low-latency reranking.\n* `BGERerankerClient` - Uses the `BAAI/bge-reranker-v2-m3` model and requires `sentence_transformers` be installed.",
  "content_length": 7069
}